ko/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ko" xml:lang="ko">
<head>
<!-- 2018-02-20 Tue 13:23 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Linux Commands</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Dongsoo Lee" />
<link rel="stylesheet" type="text/css" href="../dist/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../dist/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="../dist/org-html-themes/styles/readtheorg/css/rtd-full.css"/>
<link rel="stylesheet" type="text/css" href="../dist/org-html-themes/styles/readtheorg/css/my.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Linux Commands</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3d5a431">소개</a>
<ul>
<li><a href="#progress">진행 상황</a></li>
</ul>
</li>
<li><a href="#commands">명령어</a>
<ul>
<li><a href="#org54bf379">DNS</a></li>
<li><a href="#orgc8b861c">NIS</a></li>
<li><a href="#org35e05f7">SELinux</a></li>
<li><a href="#orgfc9729c">addbib</a></li>
<li><a href="#orgc7fe905">alias</a></li>
<li><a href="#org62f8e8f">apt-add-repository</a>
<ul>
<li><a href="#how-to-install">설치 방법</a>
<ul>
<li><a href="#prerequisites">필요 사항</a></li>
<li><a href="#install">설치</a></li>
<li><a href="#packages">설치된 패키지</a></li>
<li><a href="#check">확인</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgac3f831">apt</a></li>
<li><a href="#org15e06dd">autoconf</a>
<ul>
<li><a href="#how-to-install">설치 방법</a>
<ul>
<li><a href="#prerequisites">필요 사항</a></li>
<li><a href="#install">설치</a></li>
<li><a href="#packages">설치된 패키지</a></li>
<li><a href="#check">확인</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org9c7b15d">bash</a></li>
<li><a href="#org9fbc033">brew</a>
<ul>
<li><a href="#how-to-install">설치 방법</a>
<ul>
<li><a href="#prerequisites">필요 사항</a></li>
<li><a href="#install">설치</a></li>
<li><a href="#packages">설치된 패키지</a></li>
<li><a href="#check">확인</a></li>
</ul>
</li>
<li><a href="#references">참고자료</a></li>
</ul>
</li>
<li><a href="#org6fef5ab">build-essential</a>
<ul>
<li><a href="#overview">개요</a></li>
<li><a href="#how-to-install">설치 방법</a>
<ul>
<li><a href="#prerequisites">필요 사항</a></li>
<li><a href="#install">설치</a></li>
<li><a href="#packages">설치된 패키지</a></li>
<li><a href="#check">확인</a></li>
</ul>
</li>
<li><a href="#usage">사용법</a>
<ul>
<li><a href="#syntax">구조</a></li>
<li><a href="#configuration">설정</a></li>
<li><a href="#options">옵션</a></li>
<li><a href="#examples">사용 예</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org5ad8b36">cat</a></li>
<li><a href="#orgdc60dc6">chatter</a></li>
<li><a href="#orgb11e54a">chfn</a></li>
<li><a href="#org5babecf">chgrp</a></li>
<li><a href="#org10e8a5e">chmod</a></li>
<li><a href="#orged94b76">chown</a></li>
<li><a href="#org9785a7c">chrome</a>
<ul>
<li><a href="#how-to-install">설치 방법</a>
<ul>
<li><a href="#prerequisites">필요 사항</a></li>
<li><a href="#install">설치</a></li>
<li><a href="#packages">설치된 패키지</a></li>
<li><a href="#check">확인</a></li>
</ul>
</li>
<li><a href="#references">참고자료</a></li>
</ul>
</li>
<li><a href="#orgda8fb9e">chsh</a></li>
<li><a href="#orgd74d8ef">curl</a>
<ul>
<li><a href="#how-to-install">설치 방법</a>
<ul>
<li><a href="#prerequisites">필요 사항</a></li>
<li><a href="#install">설치</a></li>
<li><a href="#packages">설치된 패키지</a></li>
<li><a href="#check">확인</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org48c79b1">dh-autoreconf</a>
<ul>
<li><a href="#how-to-install">설치 방법</a>
<ul>
<li><a href="#prerequisites">필요 사항</a></li>
<li><a href="#install">설치</a></li>
<li><a href="#packages">설치된 패키지</a></li>
<li><a href="#check">확인</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orga4a44b9">diff</a></li>
<li><a href="#orgdc01ba4">docker-compose</a>
<ul>
<li><a href="#how-to-install">설치 방법</a>
<ul>
<li><a href="#prerequisites">필요 사항</a></li>
<li><a href="#install">설치</a></li>
<li><a href="#uninstall">제거</a></li>
<li><a href="#packages">설치된 패키지</a></li>
<li><a href="#check">확인</a></li>
</ul>
</li>
<li><a href="#references">참고자료</a></li>
</ul>
</li>
<li><a href="#org3c253d0">docker</a>
<ul>
<li><a href="#how-to-install">설치 방법</a>
<ul>
<li><a href="#prerequisites">필요 사항</a></li>
<li><a href="#install">설치</a></li>
<li><a href="#org80f72f9">Ubuntu 16.04 ~</a></li>
<li><a href="#orgf98883b">Mac</a></li>
<li><a href="#packages">설치된 패키지</a></li>
<li><a href="#check">확인</a></li>
</ul>
</li>
<li><a href="#references">참고자료</a></li>
</ul>
</li>
<li><a href="#orga833127">dpkg</a></li>
<li><a href="#org1837bcf">echo</a></li>
<li><a href="#orgf007804">emacs</a>
<ul>
<li><a href="#how-to-install">설치 방법</a>
<ul>
<li><a href="#prerequisites">필요 사항</a></li>
<li><a href="#install">설치</a></li>
<li><a href="#packages">설치된 패키지</a></li>
<li><a href="#check">확인</a></li>
</ul>
</li>
<li><a href="#references">참고자료</a></li>
</ul>
</li>
<li><a href="#org7aaf11e">find</a>
<ul>
<li><a href="#usage">사용법</a>
<ul>
<li><a href="#syntax">구조</a></li>
<li><a href="#configuration">설정</a></li>
<li><a href="#options">옵션</a></li>
<li><a href="#examples">사용 예</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org9184457">finger</a></li>
<li><a href="#org0eb3e43">fsck</a></li>
<li><a href="#org10616ed">gcc</a>
<ul>
<li><a href="#how-to-install">설치 방법</a>
<ul>
<li><a href="#prerequisites">필요 사항</a></li>
<li><a href="#install">설치</a></li>
<li><a href="#packages">설치된 패키지</a></li>
<li><a href="#check">확인</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org42e78f2">gem</a>
<ul>
<li><a href="#how-to-install">설치 방법</a>
<ul>
<li><a href="#prerequisites">필요 사항</a></li>
<li><a href="#install">설치</a></li>
<li><a href="#packages">설치된 패키지</a></li>
<li><a href="#check">확인</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org27de298">git</a>
<ul>
<li><a href="#how-to-install">설치 방법</a>
<ul>
<li><a href="#prerequisites">필요 사항</a></li>
<li><a href="#install">설치</a></li>
<li><a href="#packages">설치된 패키지</a></li>
<li><a href="#check">확인</a></li>
</ul>
</li>
<li><a href="#references">참고자료</a></li>
</ul>
</li>
<li><a href="#org250015c">groupadd</a></li>
<li><a href="#org56ad455">hcitool</a></li>
<li><a href="#org7499212">hdparm</a></li>
<li><a href="#org3288c3f">insmod</a></li>
<li><a href="#org3990c6b">iperf</a></li>
<li><a href="#orge1c3093">iptables</a></li>
<li><a href="#org49ce815">java</a></li>
<li><a href="#orgae5d879">javac</a></li>
<li><a href="#org5aa69e5">lilo</a></li>
<li><a href="#org921fef3">lp</a></li>
<li><a href="#orgdf3751c">lpc</a></li>
<li><a href="#orgad4be76">lpq</a></li>
<li><a href="#orga7ab9da">lpr</a></li>
<li><a href="#org4724dd6">lprm</a></li>
<li><a href="#orgc2d1a6f">lsattr</a></li>
<li><a href="#orgeebfc63">lsof</a></li>
<li><a href="#orgdfb6679">make</a>
<ul>
<li><a href="#how-to-install">설치 방법</a>
<ul>
<li><a href="#prerequisites">필요 사항</a></li>
<li><a href="#install">설치</a></li>
<li><a href="#packages">설치된 패키지</a></li>
<li><a href="#check">확인</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org80b858b">modprobe</a></li>
<li><a href="#org99fbd0d">node</a>
<ul>
<li><a href="#how-to-install">설치 방법</a>
<ul>
<li><a href="#prerequisites">필요 사항</a></li>
<li><a href="#install">설치</a></li>
<li><a href="#packages">설치된 패키지</a></li>
<li><a href="#check">확인</a></li>
</ul>
</li>
<li><a href="#references">참고자료</a></li>
</ul>
</li>
<li><a href="#orgf6bc1dc">npm</a>
<ul>
<li><a href="#how-to-install">설치 방법</a>
<ul>
<li><a href="#prerequisites">필요 사항</a></li>
<li><a href="#install">설치</a></li>
<li><a href="#packages">설치된 패키지</a></li>
<li><a href="#check">확인</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org14bcc61">passwd</a></li>
<li><a href="#org1ed2c9b">pip</a>
<ul>
<li><a href="#how-to-install">설치 방법</a>
<ul>
<li><a href="#prerequisites">필요 사항</a></li>
<li><a href="#install">설치</a></li>
<li><a href="#packages">설치된 패키지</a></li>
<li><a href="#check">확인</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org25fb024">postfix</a>
<ul>
<li><a href="#how-to-install">설치 방법</a>
<ul>
<li><a href="#prerequisites">필요 사항</a></li>
<li><a href="#install">설치</a></li>
<li><a href="#orgac7d051">Setup</a></li>
<li><a href="#packages">설치된 패키지</a></li>
<li><a href="#check">확인</a></li>
</ul>
</li>
<li><a href="#seealso">관련 항목</a></li>
</ul>
</li>
<li><a href="#orga84be33">rpm</a></li>
<li><a href="#org2cad2da">rsync</a>
<ul>
<li><a href="#how-to-install">설치 방법</a>
<ul>
<li><a href="#prerequisites">필요 사항</a></li>
<li><a href="#install">설치</a></li>
<li><a href="#packages">설치된 패키지</a></li>
<li><a href="#check">확인</a></li>
</ul>
</li>
<li><a href="#references">참고자료</a></li>
</ul>
</li>
<li><a href="#orgc0ac8cd">ruby</a>
<ul>
<li><a href="#how-to-install">설치 방법</a>
<ul>
<li><a href="#prerequisites">필요 사항</a></li>
<li><a href="#install">설치</a></li>
<li><a href="#packages">설치된 패키지</a></li>
<li><a href="#check">확인</a></li>
</ul>
</li>
<li><a href="#references">참고자료</a></li>
</ul>
</li>
<li><a href="#org3d22d6c">samba</a></li>
<li><a href="#orga6117bb">sendmail</a>
<ul>
<li><a href="#how-to-install">설치 방법</a>
<ul>
<li><a href="#prerequisites">필요 사항</a></li>
<li><a href="#install">설치</a></li>
<li><a href="#packages">설치된 패키지</a></li>
<li><a href="#check">확인</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgf00adb3">shutdown</a></li>
<li><a href="#orgbd0f5ca">squid</a></li>
<li><a href="#org7924ee3">ssh</a>
<ul>
<li><a href="#how-to-install">설치 방법</a>
<ul>
<li><a href="#prerequisites">필요 사항</a></li>
<li><a href="#install">설치</a></li>
<li><a href="#packages">설치된 패키지</a></li>
<li><a href="#check">확인</a></li>
</ul>
</li>
<li><a href="#references">참고자료</a></li>
</ul>
</li>
<li><a href="#orgb1accfd">sudo</a>
<ul>
<li><a href="#how-to-install">설치 방법</a>
<ul>
<li><a href="#prerequisites">필요 사항</a></li>
<li><a href="#install">설치</a></li>
<li><a href="#packages">설치된 패키지</a></li>
<li><a href="#check">확인</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org5fa870e">tail</a></li>
<li><a href="#orgb893204">tar</a></li>
<li><a href="#org2b69160">template</a>
<ul>
<li><a href="#overview">개요</a></li>
<li><a href="#how-to-install">설치 방법</a>
<ul>
<li><a href="#prerequisites">필요 사항</a></li>
<li><a href="#install">설치</a></li>
<li><a href="#packages">설치된 패키지</a></li>
<li><a href="#check">확인</a></li>
</ul>
</li>
<li><a href="#usage">사용법</a>
<ul>
<li><a href="#syntax">구조</a></li>
<li><a href="#configuration">설정</a></li>
<li><a href="#options">옵션</a></li>
<li><a href="#examples">사용 예</a></li>
</ul>
</li>
<li><a href="#seealso">관련 항목</a></li>
<li><a href="#references">참고자료</a></li>
</ul>
</li>
<li><a href="#orgeab5246">travis</a>
<ul>
<li><a href="#how-to-install">설치 방법</a>
<ul>
<li><a href="#prerequisites">필요 사항</a></li>
<li><a href="#install">설치</a></li>
<li><a href="#packages">설치된 패키지</a></li>
<li><a href="#check">확인</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orged00aba">tripwire</a></li>
<li><a href="#org36346c9">update</a>
<ul>
<li><a href="#how-to-install">설치 방법</a>
<ul>
<li><a href="#prerequisites">필요 사항</a></li>
<li><a href="#install">설치</a></li>
<li><a href="#packages">설치된 패키지</a></li>
<li><a href="#check">확인</a></li>
</ul>
</li>
<li><a href="#seealso">관련 항목</a></li>
<li><a href="#references">참고자료</a></li>
</ul>
</li>
<li><a href="#orge46666d">useradd</a></li>
<li><a href="#org16071dd">userdel</a></li>
<li><a href="#org5a5def5">usermod</a></li>
<li><a href="#orge71bd52">vim</a>
<ul>
<li><a href="#how-to-install">설치 방법</a>
<ul>
<li><a href="#prerequisites">필요 사항</a></li>
<li><a href="#install">설치</a></li>
<li><a href="#packages">설치된 패키지</a></li>
<li><a href="#check">확인</a></li>
</ul>
</li>
<li><a href="#references">참고자료</a></li>
</ul>
</li>
<li><a href="#orga07f4e6">wget</a>
<ul>
<li><a href="#how-to-install">설치 방법</a>
<ul>
<li><a href="#prerequisites">필요 사항</a></li>
<li><a href="#install">설치</a></li>
<li><a href="#packages">설치된 패키지</a></li>
<li><a href="#check">확인</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgf56b9b0">xinetd</a></li>
<li><a href="#org7f1a11b">xmodmap</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org3d5a431" class="outline-2">
<h2 id="org3d5a431">소개</h2>
<div class="outline-text-2" id="text-org3d5a431">
<div class="LANG">
<p>
운영체제 별 소프트웨어 설치 방법을 문서화하는 프로젝트입니다.
</p>

<p>
각 소프트웨어 별로 설치하기 전해 진행해야 하는 것 부터 설치 방법, 설치 후 간단한 설정 및 실행 방법 및 옵션 설명 까지가 이 프로젝트의 기술 범위입니다.
</p>

</div>
</div>
