ko/index.html

<div id="outline-container-org60fd91b" class="outline-5">
<h5 id="packages"><a id="org60fd91b"></a>설치된 패키지</h5>
<div class="outline-text-5" id="text-packages">
</div>
</div>

<div id="outline-container-orgbacbfd2" class="outline-5">
<h5 id="check"><a id="orgbacbfd2"></a>확인</h5>
<div class="outline-text-5" id="text-check">
</div>
</div>
</div>
</div>
<div id="outline-container-org9c7b15d" class="outline-3">
<h3 id="org9c7b15d">bash</h3>
<div class="outline-text-3" id="text-org9c7b15d">
</div>
</div>
<div id="outline-container-org9fbc033" class="outline-3">
<h3 id="org9fbc033">brew</h3>
<div class="outline-text-3" id="text-org9fbc033">
</div>

<div id="outline-container-org579b5b1" class="outline-4">
<h4 id="how-to-install"><a id="org579b5b1"></a>설치 방법</h4>
<div class="outline-text-4" id="text-how-to-install">
</div>

<div id="outline-container-orgfc8afb1" class="outline-5">
<h5 id="prerequisites"><a id="orgfc8afb1"></a>필요 사항</h5>
<div class="outline-text-5" id="text-prerequisites">
</div>
</div>

<div id="outline-container-org2ba9bf1" class="outline-5">
<h5 id="install"><a id="org2ba9bf1"></a>설치</h5>
<div class="outline-text-5" id="text-install">
</div>

<ul class="org-ul"><li><a id="orgd69b3aa"></a>Mac OS<br /><div class="outline-text-6" id="text-orgd69b3aa">
<div class="org-src-container">
<pre class="src src-sh">$ /usr/bin/ruby -e <span style="font-style: italic;">"$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/master/install)"</span>
</pre>
</div>
</div></li></ul>
</div>

<div id="outline-container-orgad212a7" class="outline-5">
<h5 id="packages"><a id="orgad212a7"></a>설치된 패키지</h5>
<div class="outline-text-5" id="text-packages">
</div>
</div>

<div id="outline-container-org9c6d7e1" class="outline-5">
<h5 id="check"><a id="org9c6d7e1"></a>확인</h5>
<div class="outline-text-5" id="text-check">
</div>
</div>
</div>

<div id="outline-container-org1ddfaa2" class="outline-4">
<h4 id="references"><a id="org1ddfaa2"></a>참고자료</h4>
<div class="outline-text-4" id="text-references">
<ul class="org-ul">
<li><a href="https://brew.sh/">https://brew.sh/</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org6fef5ab" class="outline-3">
<h3 id="org6fef5ab">build-essential</h3>
<div class="outline-text-3" id="text-org6fef5ab">
</div><div id="outline-container-org81fcd37" class="outline-4">
<h4 id="overview"><a id="org81fcd37"></a>개요</h4>
<div class="outline-text-4" id="text-overview">
<p>
<b>build-essential</b> 은 소스코드 빌드 시 필요한 기본적인 패키지들을 다운로드 합니다.
</p>

<p>
설치 후에는 gcc, g++, make, perl 등과 각종 라이브러리들이 설치됩니다.
</p>

<p>
설치되는 패키지는 아래 <b>Installed packages</b> 를 참고하세요.
</p>
</div>
</div>

<div id="outline-container-orgaa556db" class="outline-4">
<h4 id="how-to-install"><a id="orgaa556db"></a>설치 방법</h4>
<div class="outline-text-4" id="text-how-to-install">
</div>

<div id="outline-container-org30275ef" class="outline-5">
<h5 id="prerequisites"><a id="org30275ef"></a>필요 사항</h5>
<div class="outline-text-5" id="text-prerequisites">
<ul class="org-ul">
<li><a href="./update.html">update</a></li>
</ul>
</div>
</div>

<div id="outline-container-org266ef3e" class="outline-5">
<h5 id="install"><a id="org266ef3e"></a>설치</h5>
<div class="outline-text-5" id="text-install">
<div class="org-src-container">
<pre class="src src-sh">$ sudo apt-get install -y build-essential
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfd7c52f" class="outline-5">
<h5 id="packages"><a id="orgfd7c52f"></a>설치된 패키지</h5>
<div class="outline-text-5" id="text-packages">
<ul class="org-ul">
<li>binutils</li>
<li>bzip2</li>
<li>cpp</li>
<li>cpp-5</li>
<li>dpkg-dev</li>
<li>fakeroot</li>
<li>g++</li>
<li>g++-5</li>
<li><a href="./gcc.html">gcc</a></li>
<li>gcc-5</li>
<li>ifupdown</li>
<li>iproute2</li>
<li>isc-dhcp-client</li>
<li>isc-dhcp-common</li>
<li>libalgorithm-diff-perl</li>
<li>libalgorithm-diff-xs-perl</li>
<li>libalgorithm-merge-perl</li>
<li>libasan2</li>
<li>libatm1</li>
<li>libatomic1</li>
<li>libc-dev-bin</li>
<li>libc6-dev</li>
<li>libcc1-0</li>
<li>libcilkrts5</li>
<li>libdns-export162</li>
<li>libdpkg-perl</li>
<li>libfakeroot</li>
<li>libfile-fcntllock-perl</li>
<li>libgcc-5-dev</li>
<li>libgdbm3</li>
<li>libisc-export160</li>
<li>libisl15</li>
<li>libitm1</li>
<li>liblsan0</li>
<li>libmnl0</li>
<li>libmpc3</li>
<li>libmpfr4</li>
<li>libmpx0</li>
<li>libperl5.22</li>
<li>libquadmath0</li>
<li>libstdc++-5-dev</li>
<li>libtsan0</li>
<li>libubsan0</li>
<li>libxtables11</li>
<li>linux-libc-dev</li>
<li><a href="./make.html">make</a></li>
<li>manpages</li>
<li>manpages-dev</li>
<li>netbase</li>
<li>patch</li>
<li>perl</li>
<li>perl-modules-5.22</li>
<li>rename</li>
</ul>
</div>
</div>
