index.org
**** 설치
=gdebi= 를 이용해 dependencies 한번에 해결한다.
#+BEGIN_SRC sh
  $ wget https://dl.google.com/linux/direct/google-chrome-stable_current_amd64.deb
  $ sudo apt-get install gdebi
  $ gdebi google-chrome-stable_current_amd64.deb
#+END_SRC

**** 설치된 패키지

**** 확인

*** 참고자료
- [[https://askubuntu.com/questions/760085/how-do-you-install-google-chrome-on-ubuntu-16-04][askubuntu 참고]]
** chsh
#+MACRO: func @@html:<span class="lc-func">$1</span>@@
#+MACRO: ret @@html:<span class="lc-ret">$1</span>@@
#+MACRO: arg @@html:<span class="lc-arg">$1</span>@@
#+MACRO: kwd @@html:<span class="lc-kwd">$1</span>@@
#+MACRO: type @@html:<span class="lc-type">$1</span>@@
#+MACRO: var @@html:<span class="lc-var">$1</span>@@
#+MACRO: const @@html:<span class="lc-const">$1</span>@@
#+MACRO: path @@html:<span class="lc-path">$1</span>@@
#+MACRO: file @@html:<span class="lc-file">$1</span>@@

#+MACRO: REDIRECT @@html:<script type="javascript">location.href = "$1"</script>@@
#+MACRO: INCLUDE_PROGRESS (eval (lc-macro/include-progress))
#+MACRO: INCLUDE_DOCS (eval (lc-macro/include-docs))
#+MACRO: META (eval (lc-macro/meta))

#+HTML_HEAD: <script async src="https://www.googletagmanager.com/gtag/js?id=UA-113933734-1"></script>
#+HTML_HEAD: <script>window.dataLayer = window.dataLayer || [];function gtag(){dataLayer.push(arguments);}gtag('js', new Date());gtag('config', 'UA-113933734-1');</script>

#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../dist/org-html-themes/styles/readtheorg/css/htmlize.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../dist/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../dist/org-html-themes/styles/readtheorg/css/rtd-full.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../dist/org-html-themes/styles/readtheorg/css/my.css"/>

#+HTML_HEAD: <script type="text/javascript" src="../dist/org-html-themes/styles/lib/js/jquery-2.1.3.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="../dist/org-html-themes/styles/lib/js/bootstrap-3.3.4.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="../dist/org-html-themes/styles/lib/js/jquery.stickytableheaders.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="../dist/org-html-themes/styles/readtheorg/js/readtheorg.js"></script>

#+HTML_HEAD: <meta name="title" content="chsh - 리눅스 명령어">
#+HTML_HEAD: <meta name="description" content="">
#+HTML_HEAD: <meta name="by" content="Dongsoo Lee">
#+HTML_HEAD: <meta property="og:type" content="article">
#+HTML_HEAD: <meta property="og:title" content="chsh - 리눅스 명령어">
#+HTML_HEAD: <meta property="og:description" content="">
#+HTML_HEAD: <meta name="twitter:title" content="chsh - 리눅스 명령어">
#+HTML_HEAD: <meta name="twitter:description" content="">
** curl
#+MACRO: func @@html:<span class="lc-func">$1</span>@@
#+MACRO: ret @@html:<span class="lc-ret">$1</span>@@
#+MACRO: arg @@html:<span class="lc-arg">$1</span>@@
#+MACRO: kwd @@html:<span class="lc-kwd">$1</span>@@
#+MACRO: type @@html:<span class="lc-type">$1</span>@@
#+MACRO: var @@html:<span class="lc-var">$1</span>@@
#+MACRO: const @@html:<span class="lc-const">$1</span>@@
#+MACRO: path @@html:<span class="lc-path">$1</span>@@
#+MACRO: file @@html:<span class="lc-file">$1</span>@@

#+MACRO: REDIRECT @@html:<script type="javascript">location.href = "$1"</script>@@
#+MACRO: INCLUDE_PROGRESS (eval (lc-macro/include-progress))
#+MACRO: INCLUDE_DOCS (eval (lc-macro/include-docs))
#+MACRO: META (eval (lc-macro/meta))

#+HTML_HEAD: <script async src="https://www.googletagmanager.com/gtag/js?id=UA-113933734-1"></script>
#+HTML_HEAD: <script>window.dataLayer = window.dataLayer || [];function gtag(){dataLayer.push(arguments);}gtag('js', new Date());gtag('config', 'UA-113933734-1');</script>

#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../dist/org-html-themes/styles/readtheorg/css/htmlize.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../dist/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../dist/org-html-themes/styles/readtheorg/css/rtd-full.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../dist/org-html-themes/styles/readtheorg/css/my.css"/>

#+HTML_HEAD: <script type="text/javascript" src="../dist/org-html-themes/styles/lib/js/jquery-2.1.3.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="../dist/org-html-themes/styles/lib/js/bootstrap-3.3.4.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="../dist/org-html-themes/styles/lib/js/jquery.stickytableheaders.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="../dist/org-html-themes/styles/readtheorg/js/readtheorg.js"></script>

#+HTML_HEAD: <meta name="title" content="curl - 리눅스 명령어">
#+HTML_HEAD: <meta name="description" content="">
#+HTML_HEAD: <meta name="by" content="Dongsoo Lee">
#+HTML_HEAD: <meta property="og:type" content="article">
#+HTML_HEAD: <meta property="og:title" content="curl - 리눅스 명령어">
#+HTML_HEAD: <meta property="og:description" content="">
#+HTML_HEAD: <meta name="twitter:title" content="curl - 리눅스 명령어">
#+HTML_HEAD: <meta name="twitter:description" content="">

*** 설치 방법

**** 필요 사항

**** 설치
#+BEGIN_SRC sh
  $ sudo apt-get install curl
#+END_SRC

**** 설치된 패키지

**** 확인
** dh-autoreconf
#+MACRO: func @@html:<span class="lc-func">$1</span>@@
#+MACRO: ret @@html:<span class="lc-ret">$1</span>@@
#+MACRO: arg @@html:<span class="lc-arg">$1</span>@@
#+MACRO: kwd @@html:<span class="lc-kwd">$1</span>@@
#+MACRO: type @@html:<span class="lc-type">$1</span>@@
#+MACRO: var @@html:<span class="lc-var">$1</span>@@
#+MACRO: const @@html:<span class="lc-const">$1</span>@@
#+MACRO: path @@html:<span class="lc-path">$1</span>@@
#+MACRO: file @@html:<span class="lc-file">$1</span>@@

#+MACRO: REDIRECT @@html:<script type="javascript">location.href = "$1"</script>@@
#+MACRO: INCLUDE_PROGRESS (eval (lc-macro/include-progress))
#+MACRO: INCLUDE_DOCS (eval (lc-macro/include-docs))
#+MACRO: META (eval (lc-macro/meta))

#+HTML_HEAD: <script async src="https://www.googletagmanager.com/gtag/js?id=UA-113933734-1"></script>
#+HTML_HEAD: <script>window.dataLayer = window.dataLayer || [];function gtag(){dataLayer.push(arguments);}gtag('js', new Date());gtag('config', 'UA-113933734-1');</script>

#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../dist/org-html-themes/styles/readtheorg/css/htmlize.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../dist/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../dist/org-html-themes/styles/readtheorg/css/rtd-full.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../dist/org-html-themes/styles/readtheorg/css/my.css"/>

#+HTML_HEAD: <script type="text/javascript" src="../dist/org-html-themes/styles/lib/js/jquery-2.1.3.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="../dist/org-html-themes/styles/lib/js/bootstrap-3.3.4.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="../dist/org-html-themes/styles/lib/js/jquery.stickytableheaders.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="../dist/org-html-themes/styles/readtheorg/js/readtheorg.js"></script>

#+HTML_HEAD: <meta name="title" content="dh-autoreconf - 리눅스 명령어">
#+HTML_HEAD: <meta name="description" content="">
#+HTML_HEAD: <meta name="by" content="Dongsoo Lee">
#+HTML_HEAD: <meta property="og:type" content="article">
#+HTML_HEAD: <meta property="og:title" content="dh-autoreconf - 리눅스 명령어">
#+HTML_HEAD: <meta property="og:description" content="">
#+HTML_HEAD: <meta name="twitter:title" content="dh-autoreconf - 리눅스 명령어">
#+HTML_HEAD: <meta name="twitter:description" content="">

*** 설치 방법

**** 필요 사항
- [[file:./autoconf.org][autoconf]]

**** 설치
#+BEGIN_SRC sh
  $ sudo apt-get install dh-autoreconf
#+END_SRC

**** 설치된 패키지

**** 확인
