ko/index.html

<div id="outline-container-org4c6a8a9" class="outline-5">
<h5 id="check"><a id="org4c6a8a9"></a>확인</h5>
<div class="outline-text-5" id="text-check">
</div>
</div>
</div>

<div id="outline-container-org472733f" class="outline-4">
<h4 id="usage"><a id="org472733f"></a>사용법</h4>
<div class="outline-text-4" id="text-usage">
</div>

<div id="outline-container-org3279fe2" class="outline-5">
<h5 id="syntax"><a id="org3279fe2"></a>구조</h5>
<div class="outline-text-5" id="text-syntax">
</div>
</div>

<div id="outline-container-orgf1d317e" class="outline-5">
<h5 id="configuration"><a id="orgf1d317e"></a>설정</h5>
<div class="outline-text-5" id="text-configuration">
</div>
</div>

<div id="outline-container-org240500c" class="outline-5">
<h5 id="options"><a id="org240500c"></a>옵션</h5>
<div class="outline-text-5" id="text-options">
</div>
</div>

<div id="outline-container-orgdef8f0a" class="outline-5">
<h5 id="examples"><a id="orgdef8f0a"></a>사용 예</h5>
<div class="outline-text-5" id="text-examples">
</div>
</div>
</div>
</div>
<div id="outline-container-org5ad8b36" class="outline-3">
<h3 id="org5ad8b36">cat</h3>
<div class="outline-text-3" id="text-org5ad8b36">
</div>
</div>
<div id="outline-container-orgdc60dc6" class="outline-3">
<h3 id="orgdc60dc6">chatter</h3>
<div class="outline-text-3" id="text-orgdc60dc6">
</div>
</div>
<div id="outline-container-orgb11e54a" class="outline-3">
<h3 id="orgb11e54a">chfn</h3>
<div class="outline-text-3" id="text-orgb11e54a">
</div>
</div>
<div id="outline-container-org5babecf" class="outline-3">
<h3 id="org5babecf">chgrp</h3>
<div class="outline-text-3" id="text-org5babecf">
</div>
</div>
<div id="outline-container-org10e8a5e" class="outline-3">
<h3 id="org10e8a5e">chmod</h3>
<div class="outline-text-3" id="text-org10e8a5e">
</div>
</div>
<div id="outline-container-orged94b76" class="outline-3">
<h3 id="orged94b76">chown</h3>
<div class="outline-text-3" id="text-orged94b76">
</div>
</div>
<div id="outline-container-org9785a7c" class="outline-3">
<h3 id="org9785a7c">chrome</h3>
<div class="outline-text-3" id="text-org9785a7c">
</div>

<div id="outline-container-org42d54b5" class="outline-4">
<h4 id="how-to-install"><a id="org42d54b5"></a>설치 방법</h4>
<div class="outline-text-4" id="text-how-to-install">
</div>

<div id="outline-container-org74f61fd" class="outline-5">
<h5 id="prerequisites"><a id="org74f61fd"></a>필요 사항</h5>
<div class="outline-text-5" id="text-prerequisites">
<ul class="org-ul">
<li><a href="./wget.html">wget</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgd77a747" class="outline-5">
<h5 id="install"><a id="orgd77a747"></a>설치</h5>
<div class="outline-text-5" id="text-install">
<p>
<code>gdebi</code> 를 이용해 dependencies 한번에 해결한다.
</p>
<div class="org-src-container">
<pre class="src src-sh">$ wget https://dl.google.com/linux/direct/google-chrome-stable_current_amd64.deb
$ sudo apt-get install gdebi
$ gdebi google-chrome-stable_current_amd64.deb
</pre>
</div>
</div>
</div>

<div id="outline-container-orgeb9b055" class="outline-5">
<h5 id="packages"><a id="orgeb9b055"></a>설치된 패키지</h5>
<div class="outline-text-5" id="text-packages">
</div>
</div>

<div id="outline-container-orgfc36d2b" class="outline-5">
<h5 id="check"><a id="orgfc36d2b"></a>확인</h5>
<div class="outline-text-5" id="text-check">
</div>
</div>
</div>

<div id="outline-container-orgc8b6847" class="outline-4">
<h4 id="references"><a id="orgc8b6847"></a>참고자료</h4>
<div class="outline-text-4" id="text-references">
<ul class="org-ul">
<li><a href="https://askubuntu.com/questions/760085/how-do-you-install-google-chrome-on-ubuntu-16-04">askubuntu 참고</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgda8fb9e" class="outline-3">
<h3 id="orgda8fb9e">chsh</h3>
<div class="outline-text-3" id="text-orgda8fb9e">
</div>
</div>
<div id="outline-container-orgd74d8ef" class="outline-3">
<h3 id="orgd74d8ef">curl</h3>
<div class="outline-text-3" id="text-orgd74d8ef">
</div>

<div id="outline-container-orge1fc1da" class="outline-4">
<h4 id="how-to-install"><a id="orge1fc1da"></a>설치 방법</h4>
<div class="outline-text-4" id="text-how-to-install">
</div>

<div id="outline-container-org6315c38" class="outline-5">
<h5 id="prerequisites"><a id="org6315c38"></a>필요 사항</h5>
<div class="outline-text-5" id="text-prerequisites">
</div>
</div>

<div id="outline-container-org872406e" class="outline-5">
<h5 id="install"><a id="org872406e"></a>설치</h5>
<div class="outline-text-5" id="text-install">
<div class="org-src-container">
<pre class="src src-sh">$ sudo apt-get install curl
</pre>
</div>
</div>
</div>

<div id="outline-container-org3536d69" class="outline-5">
<h5 id="packages"><a id="org3536d69"></a>설치된 패키지</h5>
<div class="outline-text-5" id="text-packages">
</div>
</div>

<div id="outline-container-org9bb88d7" class="outline-5">
<h5 id="check"><a id="org9bb88d7"></a>확인</h5>
<div class="outline-text-5" id="text-check">
</div>
</div>
</div>
</div>
<div id="outline-container-org48c79b1" class="outline-3">
<h3 id="org48c79b1">dh-autoreconf</h3>
<div class="outline-text-3" id="text-org48c79b1">
</div>

<div id="outline-container-org48bb418" class="outline-4">
<h4 id="how-to-install"><a id="org48bb418"></a>설치 방법</h4>
<div class="outline-text-4" id="text-how-to-install">
</div>

<div id="outline-container-orgb6d7627" class="outline-5">
<h5 id="prerequisites"><a id="orgb6d7627"></a>필요 사항</h5>
<div class="outline-text-5" id="text-prerequisites">
<ul class="org-ul">
<li><a href="./autoconf.html">autoconf</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgc003aa1" class="outline-5">
<h5 id="install"><a id="orgc003aa1"></a>설치</h5>
<div class="outline-text-5" id="text-install">
<div class="org-src-container">
<pre class="src src-sh">$ sudo apt-get install dh-autoreconf
</pre>
</div>
</div>
</div>
