ko/index.html

<div id="outline-container-org212ec15" class="outline-5">
<h5 id="packages"><a id="org212ec15"></a>설치된 패키지</h5>
<div class="outline-text-5" id="text-packages">
</div>
</div>

<div id="outline-container-orgf06e391" class="outline-5">
<h5 id="check"><a id="orgf06e391"></a>확인</h5>
<div class="outline-text-5" id="text-check">
</div>
</div>
</div>
</div>
<div id="outline-container-orga4a44b9" class="outline-3">
<h3 id="orga4a44b9">diff</h3>
<div class="outline-text-3" id="text-orga4a44b9">
</div>
</div>
<div id="outline-container-orgdc01ba4" class="outline-3">
<h3 id="orgdc01ba4">docker-compose</h3>
<div class="outline-text-3" id="text-orgdc01ba4">
</div>

<div id="outline-container-org9bb34b2" class="outline-4">
<h4 id="how-to-install"><a id="org9bb34b2"></a>설치 방법</h4>
<div class="outline-text-4" id="text-how-to-install">
</div>

<div id="outline-container-org9de94b9" class="outline-5">
<h5 id="prerequisites"><a id="org9de94b9"></a>필요 사항</h5>
<div class="outline-text-5" id="text-prerequisites">
<ul class="org-ul">
<li><a href="./docker.html">docker</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgcceead4" class="outline-5">
<h5 id="install"><a id="orgcceead4"></a>설치</h5>
<div class="outline-text-5" id="text-install">
<div class="org-src-container">
<pre class="src src-sh"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Download latest docker compose</span>
$ sudo curl -L https://github.com/docker/compose/releases/download/1.18.0/docker-compose-<span style="font-weight: bold;">`uname -s`</span>-<span style="font-weight: bold;">`uname -m`</span> -o /usr/local/bin/docker-compose

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Add execution permission</span>
$ sudo chmod +x /usr/local/bin/docker-compose
</pre>
</div>
</div>
</div>

<div id="outline-container-org24e5100" class="outline-5">
<h5 id="uninstall"><a id="org24e5100"></a>제거</h5>
<div class="outline-text-5" id="text-uninstall">
<div class="org-src-container">
<pre class="src src-sh">$ sudo rm /usr/local/bin/docker-compose
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">or</span>
$ pip uninstall docker-compose
</pre>
</div>
</div>
</div>

<div id="outline-container-org0b28186" class="outline-5">
<h5 id="packages"><a id="org0b28186"></a>설치된 패키지</h5>
<div class="outline-text-5" id="text-packages">
</div>
</div>

<div id="outline-container-orgf65bb63" class="outline-5">
<h5 id="check"><a id="orgf65bb63"></a>확인</h5>
<div class="outline-text-5" id="text-check">
<div class="org-src-container">
<pre class="src src-sh">$ docker-compose --version
docker-compose version 1.18.0, build 8dd22a9
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orge80af2a" class="outline-4">
<h4 id="references"><a id="orge80af2a"></a>참고자료</h4>
<div class="outline-text-4" id="text-references">
<ul class="org-ul">
<li><a href="./docker-command-completion.html">docker-command-completion</a></li>
<li><a href="https://docs.docker.com/compose/install/#install-compose">Docker Compose Install(Offical)</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org3c253d0" class="outline-3">
<h3 id="org3c253d0">docker</h3>
<div class="outline-text-3" id="text-org3c253d0">
</div>

<div id="outline-container-org33644bf" class="outline-4">
<h4 id="how-to-install"><a id="org33644bf"></a>설치 방법</h4>
<div class="outline-text-4" id="text-how-to-install">
</div>

<div id="outline-container-org5ddf3f8" class="outline-5">
<h5 id="prerequisites"><a id="org5ddf3f8"></a>필요 사항</h5>
<div class="outline-text-5" id="text-prerequisites">
</div>
</div>

<div id="outline-container-orge90ae20" class="outline-5">
<h5 id="install"><a id="orge90ae20"></a>설치</h5>
<div class="outline-text-5" id="text-install">
</div>
</div>

<div id="outline-container-org80f72f9" class="outline-5">
<h5 id="org80f72f9">Ubuntu 16.04 ~</h5>
<div class="outline-text-5" id="text-org80f72f9">
</div><ul class="org-ul"><li><a id="orga142751"></a>Update repository<br /><div class="outline-text-6" id="text-orga142751">
<div class="org-src-container">
<pre class="src src-sh" id="org258db76"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Remove old version</span>
$ sudo apt-get remove docker docker-engine docker.io

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Install packages</span>
$ sudo apt-get install <span style="font-style: italic;">\</span>
    apt-transport-https <span style="font-style: italic;">\</span>
    ca-certificates <span style="font-style: italic;">\</span>
    curl <span style="font-style: italic;">\</span>
    software-properties-common

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Add Docker's official GPG key</span>
$ curl -fsSL https://download.docker.com/linux/ubuntu/gpg | sudo apt-key add -

$ sudo apt-key fingerprint 0EBFCD88
</pre>
</div>
</div></li>

<li><a id="orga8490ec"></a>Based on architectures<br /><ul class="org-ul"><li><a id="org1179935"></a>x86_64 / amd64<br /><div class="outline-text-7" id="text-org1179935">
<div class="org-src-container">
<pre class="src src-sh" id="org426de59">$ sudo add-apt-repository <span style="font-style: italic;">\</span>
   <span style="font-style: italic;">"deb [arch=amd64] https://download.docker.com/linux/ubuntu \</span>
<span style="font-style: italic;">   $(lsb_release -cs) \</span>
<span style="font-style: italic;">   stable"</span>
</pre>
</div>
</div></li>
