ko/index.html

<li><a id="org323a64a"></a>armhf<br /><div class="outline-text-7" id="text-org323a64a">
<div class="org-src-container">
<pre class="src src-sh" id="org100ad56">$ sudo add-apt-repository <span style="font-style: italic;">\</span>
   <span style="font-style: italic;">"deb [arch=amd64] https://download.docker.com/linux/ubuntu \</span>
<span style="font-style: italic;">   $(lsb_release -cs) \</span>
<span style="font-style: italic;">   stable"</span>
</pre>
</div>
</div></li>

<li><a id="orgdb75ebb"></a>IBM Power<br /><div class="outline-text-7" id="text-orgdb75ebb">
<div class="org-src-container">
<pre class="src src-sh" id="org73fdd5d">$ sudo add-apt-repository <span style="font-style: italic;">\</span>
   <span style="font-style: italic;">"deb [arch=ppc64el] https://download.docker.com/linux/ubuntu \</span>
<span style="font-style: italic;">   $(lsb_release -cs) \</span>
<span style="font-style: italic;">   stable"</span>
</pre>
</div>
</div></li>

<li><a id="orga8e7f87"></a>IBM Z (s390x)<br /><div class="outline-text-7" id="text-orga8e7f87">
<div class="org-src-container">
<pre class="src src-sh" id="org7ef7988">$ sudo add-apt-repository <span style="font-style: italic;">\</span>
   <span style="font-style: italic;">"deb [arch=s390x] https://download.docker.com/linux/ubuntu \</span>
<span style="font-style: italic;">   $(lsb_release -cs) \</span>
<span style="font-style: italic;">   stable"</span>
</pre>
</div>
</div></li></ul></li>
<li><a id="orge47d72b"></a>Install Docker-CE<br /><div class="outline-text-6" id="text-orge47d72b">
<div class="org-src-container">
<pre class="src src-sh" id="org23147b6">$ sudo apt-get install docker-ce
</pre>
</div>
</div></li></ul>
</div>

<div id="outline-container-orgf98883b" class="outline-5">
<h5 id="orgf98883b">Mac</h5>
<div class="outline-text-5" id="text-orgf98883b">
<ul class="org-ul">
<li><a href="https://download.docker.com/mac/stable/Docker.dmg">Docker.dmg(Official)</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgc7c25d4" class="outline-5">
<h5 id="packages"><a id="orgc7c25d4"></a>설치된 패키지</h5>
<div class="outline-text-5" id="text-packages">
</div>
</div>

<div id="outline-container-orgd19d757" class="outline-5">
<h5 id="check"><a id="orgd19d757"></a>확인</h5>
<div class="outline-text-5" id="text-check">
<div class="org-src-container">
<pre class="src src-sh">$ sudo docker run hello-world
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgfb58a11" class="outline-4">
<h4 id="references"><a id="orgfb58a11"></a>참고자료</h4>
<div class="outline-text-4" id="text-references">
<ul class="org-ul">
<li><a href="https://docs.docker.com/docker-for-mac/install/">Install Docker for Mac(Official)</a></li>
<li><a href="https://docs.docker.com/install/">Install Docker(Offical)</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orga833127" class="outline-3">
<h3 id="orga833127">dpkg</h3>
<div class="outline-text-3" id="text-orga833127">
</div>
</div>
<div id="outline-container-org1837bcf" class="outline-3">
<h3 id="org1837bcf">echo</h3>
<div class="outline-text-3" id="text-org1837bcf">
</div>
</div>
<div id="outline-container-orgf007804" class="outline-3">
<h3 id="orgf007804">emacs</h3>
<div class="outline-text-3" id="text-orgf007804">
</div>

<div id="outline-container-org851a4c4" class="outline-4">
<h4 id="how-to-install"><a id="org851a4c4"></a>설치 방법</h4>
<div class="outline-text-4" id="text-how-to-install">
</div>

<div id="outline-container-orgc73e339" class="outline-5">
<h5 id="prerequisites"><a id="orgc73e339"></a>필요 사항</h5>
<div class="outline-text-5" id="text-prerequisites">
</div>

<ul class="org-ul"><li><a id="org33dcc42"></a>Ubuntu<br /><div class="outline-text-6" id="text-org33dcc42">
<ul class="org-ul">
<li><a href="./apt-add-repository.html">apt-add-repository</a></li>
</ul>
</div></li>

<li><a id="org8daf67e"></a>Mac OS<br /><div class="outline-text-6" id="text-org8daf67e">
<ul class="org-ul">
<li><a href="./brew.html">brew</a></li>
</ul>
</div></li></ul>
</div>

<div id="outline-container-org3edb574" class="outline-5">
<h5 id="install"><a id="org3edb574"></a>설치</h5>
<div class="outline-text-5" id="text-install">
</div>

<ul class="org-ul"><li><a id="orgd39feab"></a>Ubuntu<br /><ul class="org-ul"><li><a id="org777d393"></a>Emacs 25<br /><div class="outline-text-7" id="text-org777d393">
<div class="org-src-container">
<pre class="src src-sh" id="orgb54f476">$ sudo apt-add-repository -y ppa:adrozdoff/emacs
$ sudo apt update
$ sudo apt install emacs25
</pre>
</div>
</div></li></ul></li>

<li><a id="orgcd461bd"></a>Mac OS<br /><div class="outline-text-6" id="text-orgcd461bd">
<div class="org-src-container">
<pre class="src src-sh" id="org0f4678e">$ brew install emacs
</pre>
</div>
</div></li></ul>
</div>
