index.org
**** 설치된 패키지
- aspell
- aspell-en
- dictionaries-common
- emacs25-bin-common
- emacs25-common
- emacs25-el
- emacsen-common
- enchant
- ghostscript
- gsfonts
- gstreamer1.0-plugins-base
- gstreamer1.0-plugins-good
- gstreamer1.0-x
- hunspell-en-us
- imagemagick-common
- libaa1
- libasound2
- libasound2-data
- libaspell15
- libavc1394-0
- libcaca0
- libcdparanoia0
- libcupsfilters1
- libcupsimage2
- libdv4
- libenchant1c2a
- libfftw3-double3
- libflac8
- libfribidi0
- libgeoclue0
- libgif7
- libgl1-mesa-glx
- libgpm2
- libgs9
- libgs9-common
- libgstreamer-plugins-base1.0-0
- libgstreamer-plugins-good1.0-0
- libgstreamer1.0-0
- libharfbuzz-icu0
- libhunspell-1.3-0
- libice6
- libiec61883-0
- libijs-0.35
- libjack-jackd2-0
- libjavascriptcoregtk-3.0-0
- libjbig2dec0
- liblockfile-bin
- liblockfile1
- liblqr-1-0
- libm17n-0
- libmagickcore-6.q16-2
- libmagickwand-6.q16-2
- libogg0
- libopus0
- liborc-0.4-0
- libotf0
- libpaper-utils
- libpaper1
- libraw1394-11
- libsamplerate0
- libshout3
- libslang2
- libsm6
- libspeex1
- libtag1v5
- libtag1v5-vanilla
- libtext-iconv-perl
- libtheora0
- libv4l-0
- libv4lconvert0
- libvisual-0.4-0
- libvorbis0a
- libvorbisenc2
- libwavpack1
- libwebkitgtk-3.0-0
- libwebkitgtk-3.0-common
- libwebp5
- libxcb-glx0
- libxslt1.1
- libxt6
- libxv1
- libxxf86vm1
- m17n-db
- poppler-data

**** 확인
#+BEGIN_SRC sh
  $ emacs --version
  25.3
#+END_SRC

*** 참고자료
- [[http://wikemacs.org/wiki/Installing_Emacs_on_GNU/Linux][Installing_Emacs_on_GNU/Linux]]
** find
#+MACRO: func @@html:<span class="lc-func">$1</span>@@
#+MACRO: ret @@html:<span class="lc-ret">$1</span>@@
#+MACRO: arg @@html:<span class="lc-arg">$1</span>@@
#+MACRO: kwd @@html:<span class="lc-kwd">$1</span>@@
#+MACRO: type @@html:<span class="lc-type">$1</span>@@
#+MACRO: var @@html:<span class="lc-var">$1</span>@@
#+MACRO: const @@html:<span class="lc-const">$1</span>@@
#+MACRO: path @@html:<span class="lc-path">$1</span>@@
#+MACRO: file @@html:<span class="lc-file">$1</span>@@

#+MACRO: REDIRECT @@html:<script type="javascript">location.href = "$1"</script>@@
#+MACRO: INCLUDE_PROGRESS (eval (lc-macro/include-progress))
#+MACRO: INCLUDE_DOCS (eval (lc-macro/include-docs))
#+MACRO: META (eval (lc-macro/meta))

#+HTML_HEAD: <script async src="https://www.googletagmanager.com/gtag/js?id=UA-113933734-1"></script>
#+HTML_HEAD: <script>window.dataLayer = window.dataLayer || [];function gtag(){dataLayer.push(arguments);}gtag('js', new Date());gtag('config', 'UA-113933734-1');</script>

#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../dist/org-html-themes/styles/readtheorg/css/htmlize.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../dist/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../dist/org-html-themes/styles/readtheorg/css/rtd-full.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../dist/org-html-themes/styles/readtheorg/css/my.css"/>

#+HTML_HEAD: <script type="text/javascript" src="../dist/org-html-themes/styles/lib/js/jquery-2.1.3.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="../dist/org-html-themes/styles/lib/js/bootstrap-3.3.4.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="../dist/org-html-themes/styles/lib/js/jquery.stickytableheaders.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="../dist/org-html-themes/styles/readtheorg/js/readtheorg.js"></script>

#+HTML_HEAD: <meta name="title" content="find - 리눅스 명령어">
#+HTML_HEAD: <meta name="description" content="">
#+HTML_HEAD: <meta name="by" content="Dongsoo Lee">
#+HTML_HEAD: <meta property="og:type" content="article">
#+HTML_HEAD: <meta property="og:title" content="find - 리눅스 명령어">
#+HTML_HEAD: <meta property="og:description" content="">
#+HTML_HEAD: <meta name="twitter:title" content="find - 리눅스 명령어">
#+HTML_HEAD: <meta name="twitter:description" content="">

*** 사용법

**** 구조

**** 설정

**** 옵션

**** 사용 예
- find . -type f -name *jpg -exec cp {} . \;
  - 현재 디렉토리로 부터 *.jpg 를 찾아 현재 디렉토리에 복사하기
- find . -type f -size +10000 -exec ls -alh {} \;
  - 현재 디렉토리로 부터 10M 이상의 파일을 찾아서 출력하기
- find . -atime +1 -type f -exec mv {} imsi\;
  - 현재 디렉토리로 부터 하루 이상 경과한 파일을 imsi 디렉토리로 이동 시키기
- find . -name "-F" -exec rm {} \;
  - "-F" 라는 파일을 찾아 삭제하기
- find . -exec grep -i "찾는 문자열" {} \;
  - 현재 디렉토리에서 대소문자에 상관없이 "찾는 문자열" 을 포함한 라인을 출력하기.
- find . \! -name "*.Z" -exec compress -f {} \;
  - 현재 디렉토리로 부터 *.Z 파일을 제외한 나머지 파일들을 *.Z으로 압축하기
- find . -type f \! -name "*.Z" \! -name "제외할파일명" -print | tee -a /tmp/list
  - 현재 디렉토리로부터 *.Z 파일을 제외하고 또한 "제외할 파일명" 외의 파일들을 터미널로 출력과 동시에 /tmp/list 에 추가하기
- find . -name "*.ini"
  - 현재 디렉토리로부터 이름이 *.ini인 파일을 출력하기
- find . -exec chmod 755 {} \; or chmod -R 755 ./;
  - 현재 디렉토리 이하 서브 디렉토리를 포함한 모든 파일들에 대해 퍼미션 755로 변경하기
- find . -user xuser1 -exec chown -R user2 {} \; or chown -R user2 ./
  - 현재 디렉토리로 부터 user1 소유자로 표시된 파일들을 모두 user2의 사용자 권한으로 변경하기
- find . -atime +6
  - 6일 이전의 파일들을 찾아 출력하기
- find . -atime +30 -exec ls \; | wc -l
  - 30일 이전 업데이트된 파일들의 라인수를 알아보기
- find /raid -type d -name "디렉토리명" -ok cp /복사할경로 {} \;
  - /raid 디렉토리로 부터 "디렉토리명"을 가진 파일이 존재하면 / 복사할 경로로 복사하기
- find . -name "찾을 파일" -print 2 > /dev/null
  - 찾을 파일 검색 도중 에러 및 경고 메시지는 표시하지 않게 하기
- find . -perm 700 -print
  - 파일 권한이 700인 파일을 찾기
- find . \ ( -perm 400 -o -perm 200 \) -print
  - 파일 권한이 400인 파일과 200인 파일을 찾아준다.
- find . -size +1024 -print
  - 파일의 블럭 크기가 1024 이상인 파일을 찾아준다.
- find . -name core -size +2048 -print
  - 파일 이름이 core이고 크기가 2048블럭 이상인 파일을 찾아준다.
- find . -mtime -7 -print
  - 7일 이내에 수정된 적이 있는 파일을 찾는다.
** finger
#+MACRO: func @@html:<span class="lc-func">$1</span>@@
#+MACRO: ret @@html:<span class="lc-ret">$1</span>@@
#+MACRO: arg @@html:<span class="lc-arg">$1</span>@@
#+MACRO: kwd @@html:<span class="lc-kwd">$1</span>@@
#+MACRO: type @@html:<span class="lc-type">$1</span>@@
#+MACRO: var @@html:<span class="lc-var">$1</span>@@
#+MACRO: const @@html:<span class="lc-const">$1</span>@@
#+MACRO: path @@html:<span class="lc-path">$1</span>@@
#+MACRO: file @@html:<span class="lc-file">$1</span>@@

#+MACRO: REDIRECT @@html:<script type="javascript">location.href = "$1"</script>@@
#+MACRO: INCLUDE_PROGRESS (eval (lc-macro/include-progress))
#+MACRO: INCLUDE_DOCS (eval (lc-macro/include-docs))
#+MACRO: META (eval (lc-macro/meta))

#+HTML_HEAD: <script async src="https://www.googletagmanager.com/gtag/js?id=UA-113933734-1"></script>
#+HTML_HEAD: <script>window.dataLayer = window.dataLayer || [];function gtag(){dataLayer.push(arguments);}gtag('js', new Date());gtag('config', 'UA-113933734-1');</script>

#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../dist/org-html-themes/styles/readtheorg/css/htmlize.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../dist/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../dist/org-html-themes/styles/readtheorg/css/rtd-full.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../dist/org-html-themes/styles/readtheorg/css/my.css"/>

#+HTML_HEAD: <script type="text/javascript" src="../dist/org-html-themes/styles/lib/js/jquery-2.1.3.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="../dist/org-html-themes/styles/lib/js/bootstrap-3.3.4.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="../dist/org-html-themes/styles/lib/js/jquery.stickytableheaders.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="../dist/org-html-themes/styles/readtheorg/js/readtheorg.js"></script>

#+HTML_HEAD: <meta name="title" content="finger - 리눅스 명령어">
#+HTML_HEAD: <meta name="description" content="">
#+HTML_HEAD: <meta name="by" content="Dongsoo Lee">
#+HTML_HEAD: <meta property="og:type" content="article">
#+HTML_HEAD: <meta property="og:title" content="finger - 리눅스 명령어">
#+HTML_HEAD: <meta property="og:description" content="">
#+HTML_HEAD: <meta name="twitter:title" content="finger - 리눅스 명령어">
#+HTML_HEAD: <meta name="twitter:description" content="">
