ko/index.html

<div id="outline-container-orgbe49bde" class="outline-5">
<h5 id="packages"><a id="orgbe49bde"></a>설치된 패키지</h5>
<div class="outline-text-5" id="text-packages">
<ul class="org-ul">
<li>aspell</li>
<li>aspell-en</li>
<li>dictionaries-common</li>
<li>emacs25-bin-common</li>
<li>emacs25-common</li>
<li>emacs25-el</li>
<li>emacsen-common</li>
<li>enchant</li>
<li>ghostscript</li>
<li>gsfonts</li>
<li>gstreamer1.0-plugins-base</li>
<li>gstreamer1.0-plugins-good</li>
<li>gstreamer1.0-x</li>
<li>hunspell-en-us</li>
<li>imagemagick-common</li>
<li>libaa1</li>
<li>libasound2</li>
<li>libasound2-data</li>
<li>libaspell15</li>
<li>libavc1394-0</li>
<li>libcaca0</li>
<li>libcdparanoia0</li>
<li>libcupsfilters1</li>
<li>libcupsimage2</li>
<li>libdv4</li>
<li>libenchant1c2a</li>
<li>libfftw3-double3</li>
<li>libflac8</li>
<li>libfribidi0</li>
<li>libgeoclue0</li>
<li>libgif7</li>
<li>libgl1-mesa-glx</li>
<li>libgpm2</li>
<li>libgs9</li>
<li>libgs9-common</li>
<li>libgstreamer-plugins-base1.0-0</li>
<li>libgstreamer-plugins-good1.0-0</li>
<li>libgstreamer1.0-0</li>
<li>libharfbuzz-icu0</li>
<li>libhunspell-1.3-0</li>
<li>libice6</li>
<li>libiec61883-0</li>
<li>libijs-0.35</li>
<li>libjack-jackd2-0</li>
<li>libjavascriptcoregtk-3.0-0</li>
<li>libjbig2dec0</li>
<li>liblockfile-bin</li>
<li>liblockfile1</li>
<li>liblqr-1-0</li>
<li>libm17n-0</li>
<li>libmagickcore-6.q16-2</li>
<li>libmagickwand-6.q16-2</li>
<li>libogg0</li>
<li>libopus0</li>
<li>liborc-0.4-0</li>
<li>libotf0</li>
<li>libpaper-utils</li>
<li>libpaper1</li>
<li>libraw1394-11</li>
<li>libsamplerate0</li>
<li>libshout3</li>
<li>libslang2</li>
<li>libsm6</li>
<li>libspeex1</li>
<li>libtag1v5</li>
<li>libtag1v5-vanilla</li>
<li>libtext-iconv-perl</li>
<li>libtheora0</li>
<li>libv4l-0</li>
<li>libv4lconvert0</li>
<li>libvisual-0.4-0</li>
<li>libvorbis0a</li>
<li>libvorbisenc2</li>
<li>libwavpack1</li>
<li>libwebkitgtk-3.0-0</li>
<li>libwebkitgtk-3.0-common</li>
<li>libwebp5</li>
<li>libxcb-glx0</li>
<li>libxslt1.1</li>
<li>libxt6</li>
<li>libxv1</li>
<li>libxxf86vm1</li>
<li>m17n-db</li>
<li>poppler-data</li>
</ul>
</div>
</div>

<div id="outline-container-orge400812" class="outline-5">
<h5 id="check"><a id="orge400812"></a>확인</h5>
<div class="outline-text-5" id="text-check">
<div class="org-src-container">
<pre class="src src-sh">$ emacs --version
25.3
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgccfbf40" class="outline-4">
<h4 id="references"><a id="orgccfbf40"></a>참고자료</h4>
<div class="outline-text-4" id="text-references">
<ul class="org-ul">
<li><a href="http://wikemacs.org/wiki/Installing_Emacs_on_GNU/Linux">Installing_Emacs_on_GNU/Linux</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org7aaf11e" class="outline-3">
<h3 id="org7aaf11e">find</h3>
<div class="outline-text-3" id="text-org7aaf11e">
</div>

<div id="outline-container-orgdafd9ea" class="outline-4">
<h4 id="usage"><a id="orgdafd9ea"></a>사용법</h4>
<div class="outline-text-4" id="text-usage">
</div>

<div id="outline-container-org81465d4" class="outline-5">
<h5 id="syntax"><a id="org81465d4"></a>구조</h5>
<div class="outline-text-5" id="text-syntax">
</div>
</div>

<div id="outline-container-orga495492" class="outline-5">
<h5 id="configuration"><a id="orga495492"></a>설정</h5>
<div class="outline-text-5" id="text-configuration">
</div>
</div>

<div id="outline-container-org9ee8add" class="outline-5">
<h5 id="options"><a id="org9ee8add"></a>옵션</h5>
<div class="outline-text-5" id="text-options">
</div>
</div>

<div id="outline-container-org8763cb2" class="outline-5">
<h5 id="examples"><a id="org8763cb2"></a>사용 예</h5>
<div class="outline-text-5" id="text-examples">
<ul class="org-ul">
<li>find . -type f -name *jpg -exec cp {} . \;
<ul class="org-ul">
<li>현재 디렉토리로 부터 *.jpg 를 찾아 현재 디렉토리에 복사하기</li>
</ul></li>
<li>find . -type f -size +10000 -exec ls -alh {} \;
<ul class="org-ul">
<li>현재 디렉토리로 부터 10M 이상의 파일을 찾아서 출력하기</li>
</ul></li>
<li>find . -atime +1 -type f -exec mv {} imsi\;
<ul class="org-ul">
<li>현재 디렉토리로 부터 하루 이상 경과한 파일을 imsi 디렉토리로 이동 시키기</li>
</ul></li>
<li>find . -name "-F" -exec rm {} \;
<ul class="org-ul">
<li>"-F" 라는 파일을 찾아 삭제하기</li>
</ul></li>
<li>find . -exec grep -i "찾는 문자열" {} \;
<ul class="org-ul">
<li>현재 디렉토리에서 대소문자에 상관없이 "찾는 문자열" 을 포함한 라인을 출력하기.</li>
</ul></li>
<li>find . \! -name "*.Z" -exec compress -f {} \;
<ul class="org-ul">
<li>현재 디렉토리로 부터 *.Z 파일을 제외한 나머지 파일들을 *.Z으로 압축하기</li>
</ul></li>
<li>find . -type f \! -name "*.Z" \! -name "제외할파일명" -print | tee -a /tmp/list
<ul class="org-ul">
<li>현재 디렉토리로부터 *.Z 파일을 제외하고 또한 "제외할 파일명" 외의 파일들을 터미널로 출력과 동시에 /tmp/list 에 추가하기</li>
</ul></li>
<li>find . -name "*.ini"
<ul class="org-ul">
<li>현재 디렉토리로부터 이름이 *.ini인 파일을 출력하기</li>
</ul></li>
<li>find . -exec chmod 755 {} \; or chmod -R 755 ./;
<ul class="org-ul">
<li>현재 디렉토리 이하 서브 디렉토리를 포함한 모든 파일들에 대해 퍼미션 755로 변경하기</li>
</ul></li>
<li>find . -user xuser1 -exec chown -R user2 {} \; or chown -R user2 ./
<ul class="org-ul">
<li>현재 디렉토리로 부터 user1 소유자로 표시된 파일들을 모두 user2의 사용자 권한으로 변경하기</li>
</ul></li>
<li>find . -atime +6
<ul class="org-ul">
<li>6일 이전의 파일들을 찾아 출력하기</li>
</ul></li>
<li>find . -atime +30 -exec ls \; | wc -l
<ul class="org-ul">
<li>30일 이전 업데이트된 파일들의 라인수를 알아보기</li>
</ul></li>
<li>find /raid -type d -name "디렉토리명" -ok cp /복사할경로 {} \;
<ul class="org-ul">
<li>/raid 디렉토리로 부터 "디렉토리명"을 가진 파일이 존재하면 / 복사할 경로로 복사하기</li>
</ul></li>
<li>find . -name "찾을 파일" -print 2 &gt; /dev/null
<ul class="org-ul">
<li>찾을 파일 검색 도중 에러 및 경고 메시지는 표시하지 않게 하기</li>
</ul></li>
<li>find . -perm 700 -print
<ul class="org-ul">
<li>파일 권한이 700인 파일을 찾기</li>
</ul></li>
<li>find . \ ( -perm 400 -o -perm 200 \) -print
<ul class="org-ul">
<li>파일 권한이 400인 파일과 200인 파일을 찾아준다.</li>
</ul></li>
<li>find . -size +1024 -print
<ul class="org-ul">
<li>파일의 블럭 크기가 1024 이상인 파일을 찾아준다.</li>
</ul></li>
<li>find . -name core -size +2048 -print
<ul class="org-ul">
<li>파일 이름이 core이고 크기가 2048블럭 이상인 파일을 찾아준다.</li>
</ul></li>
<li>find . -mtime -7 -print
<ul class="org-ul">
<li>7일 이내에 수정된 적이 있는 파일을 찾는다.</li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
