ko/index.html
<div id="outline-container-org9184457" class="outline-3">
<h3 id="org9184457">finger</h3>
<div class="outline-text-3" id="text-org9184457">
</div>
</div>
<div id="outline-container-org0eb3e43" class="outline-3">
<h3 id="org0eb3e43">fsck</h3>
<div class="outline-text-3" id="text-org0eb3e43">
</div>
</div>
<div id="outline-container-org10616ed" class="outline-3">
<h3 id="org10616ed">gcc</h3>
<div class="outline-text-3" id="text-org10616ed">
</div>

<div id="outline-container-org5ca2264" class="outline-4">
<h4 id="how-to-install"><a id="org5ca2264"></a>설치 방법</h4>
<div class="outline-text-4" id="text-how-to-install">
</div>

<div id="outline-container-org6d6b600" class="outline-5">
<h5 id="prerequisites"><a id="org6d6b600"></a>필요 사항</h5>
<div class="outline-text-5" id="text-prerequisites">
</div>
</div>

<div id="outline-container-orgcc97964" class="outline-5">
<h5 id="install"><a id="orgcc97964"></a>설치</h5>
<div class="outline-text-5" id="text-install">
<p>
See <a href="./build-essential.html">build-essential</a>
</p>
</div>
</div>

<div id="outline-container-orgb7a5ec3" class="outline-5">
<h5 id="packages"><a id="orgb7a5ec3"></a>설치된 패키지</h5>
<div class="outline-text-5" id="text-packages">
</div>
</div>

<div id="outline-container-orgca181a4" class="outline-5">
<h5 id="check"><a id="orgca181a4"></a>확인</h5>
<div class="outline-text-5" id="text-check">
</div>
</div>
</div>
</div>
<div id="outline-container-org42e78f2" class="outline-3">
<h3 id="org42e78f2">gem</h3>
<div class="outline-text-3" id="text-org42e78f2">
</div>

<div id="outline-container-org1a52f25" class="outline-4">
<h4 id="how-to-install"><a id="org1a52f25"></a>설치 방법</h4>
<div class="outline-text-4" id="text-how-to-install">
</div>

<div id="outline-container-orgcc1a907" class="outline-5">
<h5 id="prerequisites"><a id="orgcc1a907"></a>필요 사항</h5>
<div class="outline-text-5" id="text-prerequisites">
</div>
</div>

<div id="outline-container-orgdc7dc6a" class="outline-5">
<h5 id="install"><a id="orgdc7dc6a"></a>설치</h5>
<div class="outline-text-5" id="text-install">
<p>
See <a href="./ruby.html">ruby</a>
</p>
</div>
</div>
<div id="outline-container-orgc1b17ab" class="outline-5">
<h5 id="packages"><a id="orgc1b17ab"></a>설치된 패키지</h5>
<div class="outline-text-5" id="text-packages">
</div>
</div>

<div id="outline-container-orgcd29d6a" class="outline-5">
<h5 id="check"><a id="orgcd29d6a"></a>확인</h5>
<div class="outline-text-5" id="text-check">
<div class="org-src-container">
<pre class="src src-sh">$ gem -v
2.7.3
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-org27de298" class="outline-3">
<h3 id="org27de298">git</h3>
<div class="outline-text-3" id="text-org27de298">
</div>

<div id="outline-container-org17b0909" class="outline-4">
<h4 id="how-to-install"><a id="org17b0909"></a>설치 방법</h4>
<div class="outline-text-4" id="text-how-to-install">
</div>

<div id="outline-container-org8c7d874" class="outline-5">
<h5 id="prerequisites"><a id="org8c7d874"></a>필요 사항</h5>
<div class="outline-text-5" id="text-prerequisites">
<ul class="org-ul">
<li><a href="./update.html">update</a></li>
</ul>
</div>
</div>

<div id="outline-container-org69889e8" class="outline-5">
<h5 id="install"><a id="org69889e8"></a>설치</h5>
<div class="outline-text-5" id="text-install">
</div>

<ul class="org-ul"><li><a id="orgd76009b"></a>Ubuntu<br /><div class="outline-text-6" id="text-orgd76009b">
<div class="org-src-container">
<pre class="src src-sh" id="org0a28905">$ sudo apt-get install git
</pre>
</div>
</div></li>

<li><a id="orge29b4c2"></a>CentOS<br /><div class="outline-text-6" id="text-orge29b4c2">
<div class="org-src-container">
<pre class="src src-sh" id="org9e5eb70">$ sudo yum install git
</pre>
</div>
</div></li>

<li><a id="org831c050"></a>Fedora<br /><div class="outline-text-6" id="text-org831c050">
<div class="org-src-container">
<pre class="src src-sh" id="org4b67982">$ sudo yum install git-core
</pre>
</div>
</div></li>

<li><a id="org5aebe9e"></a>Arch Linux<br /><div class="outline-text-6" id="text-org5aebe9e">
<div class="org-src-container">
<pre class="src src-sh" id="org6cd17db">$ sudo pacman -Sy git
</pre>
</div>
</div></li>

<li><a id="org4e3165f"></a>Gentoo<br /><div class="outline-text-6" id="text-org4e3165f">
<div class="org-src-container">
<pre class="src src-sh" id="orga3863da">$ sudo emerge --ask --verbose dev-vcs/git
</pre>
</div>
</div></li>

<li><a id="org64d821c"></a>macOS<br /><div class="outline-text-6" id="text-org64d821c">
<div class="org-src-container">
<pre class="src src-sh" id="orgc17e55b">$ brew install git
</pre>
</div>
</div></li></ul>
</div>
