index.org
*** 참고자료
- [[https://linode.com/docs/development/version-control/how-to-install-git-on-linux-mac-and-windows/][how-to-install-git-on-linux-mac-and-windows]]
** groupadd
#+MACRO: func @@html:<span class="lc-func">$1</span>@@
#+MACRO: ret @@html:<span class="lc-ret">$1</span>@@
#+MACRO: arg @@html:<span class="lc-arg">$1</span>@@
#+MACRO: kwd @@html:<span class="lc-kwd">$1</span>@@
#+MACRO: type @@html:<span class="lc-type">$1</span>@@
#+MACRO: var @@html:<span class="lc-var">$1</span>@@
#+MACRO: const @@html:<span class="lc-const">$1</span>@@
#+MACRO: path @@html:<span class="lc-path">$1</span>@@
#+MACRO: file @@html:<span class="lc-file">$1</span>@@

#+MACRO: REDIRECT @@html:<script type="javascript">location.href = "$1"</script>@@
#+MACRO: INCLUDE_PROGRESS (eval (lc-macro/include-progress))
#+MACRO: INCLUDE_DOCS (eval (lc-macro/include-docs))
#+MACRO: META (eval (lc-macro/meta))

#+HTML_HEAD: <script async src="https://www.googletagmanager.com/gtag/js?id=UA-113933734-1"></script>
#+HTML_HEAD: <script>window.dataLayer = window.dataLayer || [];function gtag(){dataLayer.push(arguments);}gtag('js', new Date());gtag('config', 'UA-113933734-1');</script>

#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../dist/org-html-themes/styles/readtheorg/css/htmlize.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../dist/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../dist/org-html-themes/styles/readtheorg/css/rtd-full.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../dist/org-html-themes/styles/readtheorg/css/my.css"/>

#+HTML_HEAD: <script type="text/javascript" src="../dist/org-html-themes/styles/lib/js/jquery-2.1.3.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="../dist/org-html-themes/styles/lib/js/bootstrap-3.3.4.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="../dist/org-html-themes/styles/lib/js/jquery.stickytableheaders.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="../dist/org-html-themes/styles/readtheorg/js/readtheorg.js"></script>

#+HTML_HEAD: <meta name="title" content="groupadd - 리눅스 명령어">
#+HTML_HEAD: <meta name="description" content="">
#+HTML_HEAD: <meta name="by" content="Dongsoo Lee">
#+HTML_HEAD: <meta property="og:type" content="article">
#+HTML_HEAD: <meta property="og:title" content="groupadd - 리눅스 명령어">
#+HTML_HEAD: <meta property="og:description" content="">
#+HTML_HEAD: <meta name="twitter:title" content="groupadd - 리눅스 명령어">
#+HTML_HEAD: <meta name="twitter:description" content="">
** hcitool
#+MACRO: func @@html:<span class="lc-func">$1</span>@@
#+MACRO: ret @@html:<span class="lc-ret">$1</span>@@
#+MACRO: arg @@html:<span class="lc-arg">$1</span>@@
#+MACRO: kwd @@html:<span class="lc-kwd">$1</span>@@
#+MACRO: type @@html:<span class="lc-type">$1</span>@@
#+MACRO: var @@html:<span class="lc-var">$1</span>@@
#+MACRO: const @@html:<span class="lc-const">$1</span>@@
#+MACRO: path @@html:<span class="lc-path">$1</span>@@
#+MACRO: file @@html:<span class="lc-file">$1</span>@@

#+MACRO: REDIRECT @@html:<script type="javascript">location.href = "$1"</script>@@
#+MACRO: INCLUDE_PROGRESS (eval (lc-macro/include-progress))
#+MACRO: INCLUDE_DOCS (eval (lc-macro/include-docs))
#+MACRO: META (eval (lc-macro/meta))

#+HTML_HEAD: <script async src="https://www.googletagmanager.com/gtag/js?id=UA-113933734-1"></script>
#+HTML_HEAD: <script>window.dataLayer = window.dataLayer || [];function gtag(){dataLayer.push(arguments);}gtag('js', new Date());gtag('config', 'UA-113933734-1');</script>

#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../dist/org-html-themes/styles/readtheorg/css/htmlize.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../dist/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../dist/org-html-themes/styles/readtheorg/css/rtd-full.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../dist/org-html-themes/styles/readtheorg/css/my.css"/>

#+HTML_HEAD: <script type="text/javascript" src="../dist/org-html-themes/styles/lib/js/jquery-2.1.3.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="../dist/org-html-themes/styles/lib/js/bootstrap-3.3.4.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="../dist/org-html-themes/styles/lib/js/jquery.stickytableheaders.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="../dist/org-html-themes/styles/readtheorg/js/readtheorg.js"></script>

#+HTML_HEAD: <meta name="title" content="hcitool - 리눅스 명령어">
#+HTML_HEAD: <meta name="description" content="">
#+HTML_HEAD: <meta name="by" content="Dongsoo Lee">
#+HTML_HEAD: <meta property="og:type" content="article">
#+HTML_HEAD: <meta property="og:title" content="hcitool - 리눅스 명령어">
#+HTML_HEAD: <meta property="og:description" content="">
#+HTML_HEAD: <meta name="twitter:title" content="hcitool - 리눅스 명령어">
#+HTML_HEAD: <meta name="twitter:description" content="">
** hdparm
#+MACRO: func @@html:<span class="lc-func">$1</span>@@
#+MACRO: ret @@html:<span class="lc-ret">$1</span>@@
#+MACRO: arg @@html:<span class="lc-arg">$1</span>@@
#+MACRO: kwd @@html:<span class="lc-kwd">$1</span>@@
#+MACRO: type @@html:<span class="lc-type">$1</span>@@
#+MACRO: var @@html:<span class="lc-var">$1</span>@@
#+MACRO: const @@html:<span class="lc-const">$1</span>@@
#+MACRO: path @@html:<span class="lc-path">$1</span>@@
#+MACRO: file @@html:<span class="lc-file">$1</span>@@

#+MACRO: REDIRECT @@html:<script type="javascript">location.href = "$1"</script>@@
#+MACRO: INCLUDE_PROGRESS (eval (lc-macro/include-progress))
#+MACRO: INCLUDE_DOCS (eval (lc-macro/include-docs))
#+MACRO: META (eval (lc-macro/meta))

#+HTML_HEAD: <script async src="https://www.googletagmanager.com/gtag/js?id=UA-113933734-1"></script>
#+HTML_HEAD: <script>window.dataLayer = window.dataLayer || [];function gtag(){dataLayer.push(arguments);}gtag('js', new Date());gtag('config', 'UA-113933734-1');</script>

#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../dist/org-html-themes/styles/readtheorg/css/htmlize.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../dist/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../dist/org-html-themes/styles/readtheorg/css/rtd-full.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../dist/org-html-themes/styles/readtheorg/css/my.css"/>

#+HTML_HEAD: <script type="text/javascript" src="../dist/org-html-themes/styles/lib/js/jquery-2.1.3.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="../dist/org-html-themes/styles/lib/js/bootstrap-3.3.4.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="../dist/org-html-themes/styles/lib/js/jquery.stickytableheaders.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="../dist/org-html-themes/styles/readtheorg/js/readtheorg.js"></script>

#+HTML_HEAD: <meta name="title" content="hdparm - 리눅스 명령어">
#+HTML_HEAD: <meta name="description" content="">
#+HTML_HEAD: <meta name="by" content="Dongsoo Lee">
#+HTML_HEAD: <meta property="og:type" content="article">
#+HTML_HEAD: <meta property="og:title" content="hdparm - 리눅스 명령어">
#+HTML_HEAD: <meta property="og:description" content="">
#+HTML_HEAD: <meta name="twitter:title" content="hdparm - 리눅스 명령어">
#+HTML_HEAD: <meta name="twitter:description" content="">
** insmod
#+MACRO: func @@html:<span class="lc-func">$1</span>@@
#+MACRO: ret @@html:<span class="lc-ret">$1</span>@@
#+MACRO: arg @@html:<span class="lc-arg">$1</span>@@
#+MACRO: kwd @@html:<span class="lc-kwd">$1</span>@@
#+MACRO: type @@html:<span class="lc-type">$1</span>@@
#+MACRO: var @@html:<span class="lc-var">$1</span>@@
#+MACRO: const @@html:<span class="lc-const">$1</span>@@
#+MACRO: path @@html:<span class="lc-path">$1</span>@@
#+MACRO: file @@html:<span class="lc-file">$1</span>@@

#+MACRO: REDIRECT @@html:<script type="javascript">location.href = "$1"</script>@@
#+MACRO: INCLUDE_PROGRESS (eval (lc-macro/include-progress))
#+MACRO: INCLUDE_DOCS (eval (lc-macro/include-docs))
#+MACRO: META (eval (lc-macro/meta))

#+HTML_HEAD: <script async src="https://www.googletagmanager.com/gtag/js?id=UA-113933734-1"></script>
#+HTML_HEAD: <script>window.dataLayer = window.dataLayer || [];function gtag(){dataLayer.push(arguments);}gtag('js', new Date());gtag('config', 'UA-113933734-1');</script>

#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../dist/org-html-themes/styles/readtheorg/css/htmlize.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../dist/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../dist/org-html-themes/styles/readtheorg/css/rtd-full.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../dist/org-html-themes/styles/readtheorg/css/my.css"/>

#+HTML_HEAD: <script type="text/javascript" src="../dist/org-html-themes/styles/lib/js/jquery-2.1.3.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="../dist/org-html-themes/styles/lib/js/bootstrap-3.3.4.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="../dist/org-html-themes/styles/lib/js/jquery.stickytableheaders.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="../dist/org-html-themes/styles/readtheorg/js/readtheorg.js"></script>

#+HTML_HEAD: <meta name="title" content="insmod - 리눅스 명령어">
#+HTML_HEAD: <meta name="description" content="">
#+HTML_HEAD: <meta name="by" content="Dongsoo Lee">
#+HTML_HEAD: <meta property="og:type" content="article">
#+HTML_HEAD: <meta property="og:title" content="insmod - 리눅스 명령어">
#+HTML_HEAD: <meta property="og:description" content="">
#+HTML_HEAD: <meta name="twitter:title" content="insmod - 리눅스 명령어">
#+HTML_HEAD: <meta name="twitter:description" content="">
** iperf
#+MACRO: func @@html:<span class="lc-func">$1</span>@@
#+MACRO: ret @@html:<span class="lc-ret">$1</span>@@
#+MACRO: arg @@html:<span class="lc-arg">$1</span>@@
#+MACRO: kwd @@html:<span class="lc-kwd">$1</span>@@
#+MACRO: type @@html:<span class="lc-type">$1</span>@@
#+MACRO: var @@html:<span class="lc-var">$1</span>@@
#+MACRO: const @@html:<span class="lc-const">$1</span>@@
#+MACRO: path @@html:<span class="lc-path">$1</span>@@
#+MACRO: file @@html:<span class="lc-file">$1</span>@@

#+MACRO: REDIRECT @@html:<script type="javascript">location.href = "$1"</script>@@
#+MACRO: INCLUDE_PROGRESS (eval (lc-macro/include-progress))
#+MACRO: INCLUDE_DOCS (eval (lc-macro/include-docs))
#+MACRO: META (eval (lc-macro/meta))

#+HTML_HEAD: <script async src="https://www.googletagmanager.com/gtag/js?id=UA-113933734-1"></script>
#+HTML_HEAD: <script>window.dataLayer = window.dataLayer || [];function gtag(){dataLayer.push(arguments);}gtag('js', new Date());gtag('config', 'UA-113933734-1');</script>

#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../dist/org-html-themes/styles/readtheorg/css/htmlize.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../dist/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../dist/org-html-themes/styles/readtheorg/css/rtd-full.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../dist/org-html-themes/styles/readtheorg/css/my.css"/>

#+HTML_HEAD: <script type="text/javascript" src="../dist/org-html-themes/styles/lib/js/jquery-2.1.3.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="../dist/org-html-themes/styles/lib/js/bootstrap-3.3.4.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="../dist/org-html-themes/styles/lib/js/jquery.stickytableheaders.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="../dist/org-html-themes/styles/readtheorg/js/readtheorg.js"></script>

#+HTML_HEAD: <meta name="title" content="iperf - 리눅스 명령어">
#+HTML_HEAD: <meta name="description" content="">
#+HTML_HEAD: <meta name="by" content="Dongsoo Lee">
#+HTML_HEAD: <meta property="og:type" content="article">
#+HTML_HEAD: <meta property="og:title" content="iperf - 리눅스 명령어">
#+HTML_HEAD: <meta property="og:description" content="">
#+HTML_HEAD: <meta name="twitter:title" content="iperf - 리눅스 명령어">
#+HTML_HEAD: <meta name="twitter:description" content="">
** iptables
#+MACRO: func @@html:<span class="lc-func">$1</span>@@
#+MACRO: ret @@html:<span class="lc-ret">$1</span>@@
#+MACRO: arg @@html:<span class="lc-arg">$1</span>@@
#+MACRO: kwd @@html:<span class="lc-kwd">$1</span>@@
#+MACRO: type @@html:<span class="lc-type">$1</span>@@
#+MACRO: var @@html:<span class="lc-var">$1</span>@@
#+MACRO: const @@html:<span class="lc-const">$1</span>@@
#+MACRO: path @@html:<span class="lc-path">$1</span>@@
#+MACRO: file @@html:<span class="lc-file">$1</span>@@

#+MACRO: REDIRECT @@html:<script type="javascript">location.href = "$1"</script>@@
#+MACRO: INCLUDE_PROGRESS (eval (lc-macro/include-progress))
#+MACRO: INCLUDE_DOCS (eval (lc-macro/include-docs))
#+MACRO: META (eval (lc-macro/meta))

#+HTML_HEAD: <script async src="https://www.googletagmanager.com/gtag/js?id=UA-113933734-1"></script>
#+HTML_HEAD: <script>window.dataLayer = window.dataLayer || [];function gtag(){dataLayer.push(arguments);}gtag('js', new Date());gtag('config', 'UA-113933734-1');</script>

#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../dist/org-html-themes/styles/readtheorg/css/htmlize.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../dist/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../dist/org-html-themes/styles/readtheorg/css/rtd-full.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../dist/org-html-themes/styles/readtheorg/css/my.css"/>

#+HTML_HEAD: <script type="text/javascript" src="../dist/org-html-themes/styles/lib/js/jquery-2.1.3.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="../dist/org-html-themes/styles/lib/js/bootstrap-3.3.4.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="../dist/org-html-themes/styles/lib/js/jquery.stickytableheaders.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="../dist/org-html-themes/styles/readtheorg/js/readtheorg.js"></script>

#+HTML_HEAD: <meta name="title" content="iptables - 리눅스 명령어">
#+HTML_HEAD: <meta name="description" content="">
#+HTML_HEAD: <meta name="by" content="Dongsoo Lee">
#+HTML_HEAD: <meta property="og:type" content="article">
#+HTML_HEAD: <meta property="og:title" content="iptables - 리눅스 명령어">
#+HTML_HEAD: <meta property="og:description" content="">
#+HTML_HEAD: <meta name="twitter:title" content="iptables - 리눅스 명령어">
#+HTML_HEAD: <meta name="twitter:description" content="">
