ko/index.html


<div id="outline-container-org520803d" class="outline-5">
<h5 id="packages"><a id="org520803d"></a>설치된 패키지</h5>
<div class="outline-text-5" id="text-packages">
</div>
</div>

<div id="outline-container-org2ad0980" class="outline-5">
<h5 id="check"><a id="org2ad0980"></a>확인</h5>
<div class="outline-text-5" id="text-check">
</div>
</div>
</div>

<div id="outline-container-org44e6294" class="outline-4">
<h4 id="references"><a id="org44e6294"></a>참고자료</h4>
<div class="outline-text-4" id="text-references">
<ul class="org-ul">
<li><a href="https://linode.com/docs/development/version-control/how-to-install-git-on-linux-mac-and-windows/">how-to-install-git-on-linux-mac-and-windows</a></li>
</ul>
</div>
</div>
</div>
