ko/index.html
<div id="outline-container-org250015c" class="outline-3">
<h3 id="org250015c">groupadd</h3>
<div class="outline-text-3" id="text-org250015c">
</div>
</div>
<div id="outline-container-org56ad455" class="outline-3">
<h3 id="org56ad455">hcitool</h3>
<div class="outline-text-3" id="text-org56ad455">
</div>
</div>
<div id="outline-container-org7499212" class="outline-3">
<h3 id="org7499212">hdparm</h3>
<div class="outline-text-3" id="text-org7499212">
</div>
</div>
<div id="outline-container-org3288c3f" class="outline-3">
<h3 id="org3288c3f">insmod</h3>
<div class="outline-text-3" id="text-org3288c3f">
</div>
</div>
<div id="outline-container-org3990c6b" class="outline-3">
<h3 id="org3990c6b">iperf</h3>
<div class="outline-text-3" id="text-org3990c6b">
</div>
</div>
<div id="outline-container-orge1c3093" class="outline-3">
<h3 id="orge1c3093">iptables</h3>
<div class="outline-text-3" id="text-orge1c3093">
</div>
</div>
<div id="outline-container-org49ce815" class="outline-3">
<h3 id="org49ce815">java</h3>
<div class="outline-text-3" id="text-org49ce815">
</div>
</div>
<div id="outline-container-orgae5d879" class="outline-3">
<h3 id="orgae5d879">javac</h3>
<div class="outline-text-3" id="text-orgae5d879">
</div>
</div>
<div id="outline-container-org5aa69e5" class="outline-3">
<h3 id="org5aa69e5">lilo</h3>
<div class="outline-text-3" id="text-org5aa69e5">
</div>
</div>
<div id="outline-container-org921fef3" class="outline-3">
<h3 id="org921fef3">lp</h3>
<div class="outline-text-3" id="text-org921fef3">
</div>
</div>
<div id="outline-container-orgdf3751c" class="outline-3">
<h3 id="orgdf3751c">lpc</h3>
<div class="outline-text-3" id="text-orgdf3751c">
</div>
</div>
<div id="outline-container-orgad4be76" class="outline-3">
<h3 id="orgad4be76">lpq</h3>
<div class="outline-text-3" id="text-orgad4be76">
</div>
</div>
<div id="outline-container-orga7ab9da" class="outline-3">
<h3 id="orga7ab9da">lpr</h3>
<div class="outline-text-3" id="text-orga7ab9da">
</div>
</div>
<div id="outline-container-org4724dd6" class="outline-3">
<h3 id="org4724dd6">lprm</h3>
<div class="outline-text-3" id="text-org4724dd6">
</div>
</div>
<div id="outline-container-orgc2d1a6f" class="outline-3">
<h3 id="orgc2d1a6f">lsattr</h3>
<div class="outline-text-3" id="text-orgc2d1a6f">
</div>
</div>
<div id="outline-container-orgeebfc63" class="outline-3">
<h3 id="orgeebfc63">lsof</h3>
<div class="outline-text-3" id="text-orgeebfc63">
</div>
</div>
<div id="outline-container-orgdfb6679" class="outline-3">
<h3 id="orgdfb6679">make</h3>
<div class="outline-text-3" id="text-orgdfb6679">
</div>

<div id="outline-container-org1178083" class="outline-4">
<h4 id="how-to-install"><a id="org1178083"></a>설치 방법</h4>
<div class="outline-text-4" id="text-how-to-install">
</div>

<div id="outline-container-org3fc60b2" class="outline-5">
<h5 id="prerequisites"><a id="org3fc60b2"></a>필요 사항</h5>
<div class="outline-text-5" id="text-prerequisites">
</div>
</div>

<div id="outline-container-org08d1b4b" class="outline-5">
<h5 id="install"><a id="org08d1b4b"></a>설치</h5>
<div class="outline-text-5" id="text-install">
<p>
See <a href="./build-essential.html">build-essential</a>
</p>
</div>
</div>

<div id="outline-container-org6e9460c" class="outline-5">
<h5 id="packages"><a id="org6e9460c"></a>설치된 패키지</h5>
<div class="outline-text-5" id="text-packages">
</div>
</div>

<div id="outline-container-orgebedade" class="outline-5">
<h5 id="check"><a id="orgebedade"></a>확인</h5>
<div class="outline-text-5" id="text-check">
</div>
</div>
</div>
</div>
<div id="outline-container-org80b858b" class="outline-3">
<h3 id="org80b858b">modprobe</h3>
<div class="outline-text-3" id="text-org80b858b">
</div>
</div>
<div id="outline-container-org99fbd0d" class="outline-3">
<h3 id="org99fbd0d">node</h3>
<div class="outline-text-3" id="text-org99fbd0d">
</div>

<div id="outline-container-orgc6a3374" class="outline-4">
<h4 id="how-to-install"><a id="orgc6a3374"></a>설치 방법</h4>
<div class="outline-text-4" id="text-how-to-install">
</div>

<div id="outline-container-orgf4972a0" class="outline-5">
<h5 id="prerequisites"><a id="orgf4972a0"></a>필요 사항</h5>
<div class="outline-text-5" id="text-prerequisites">
<ul class="org-ul">
<li><a href="./sudo.html">sudo</a></li>
<li><a href="./curl.html">curl</a></li>
</ul>
</div>

<ul class="org-ul"><li><a id="org92bb3dd"></a>4.x<br /><div class="outline-text-6" id="text-org92bb3dd">
<div class="org-src-container">
<pre class="src src-sh" id="org858b46b">$ curl -sL https://deb.nodesource.com/setup_4.x | sudo -E bash -
</pre>
</div>
</div></li>

<li><a id="org6ce1eeb"></a>6.x<br /><div class="outline-text-6" id="text-org6ce1eeb">
<div class="org-src-container">
<pre class="src src-sh" id="org74ec8cd">$ curl -sL https://deb.nodesource.com/setup_6.x | sudo -E bash -
</pre>
</div>
</div></li>

<li><a id="org7ddafd2"></a>7.x<br /><div class="outline-text-6" id="text-org7ddafd2">
<div class="org-src-container">
<pre class="src src-sh" id="orgecaf931">$ curl -sL https://deb.nodesource.com/setup_7.x | sudo -E bash -
</pre>
</div>
</div></li>

<li><a id="orgbc18d6c"></a>9.x<br /><div class="outline-text-6" id="text-orgbc18d6c">
<div class="org-src-container">
<pre class="src src-sh" id="org19bb01a">$ curl -sL https://deb.nodesource.com/setup_9.x | sudo -E bash -
</pre>
</div>
</div></li></ul>
</div>


<div id="outline-container-org6e3da8e" class="outline-5">
<h5 id="install"><a id="org6e3da8e"></a>설치</h5>
<div class="outline-text-5" id="text-install">
</div>

<ul class="org-ul"><li><a id="orgc72026c"></a>Ubuntu<br /><div class="outline-text-6" id="text-orgc72026c">
<div class="org-src-container">
<pre class="src src-sh">$ sudo apt-get install nodejs
$ sudo apt-get install build-essential
</pre>
</div>
</div></li></ul>
</div>

<div id="outline-container-orgc6ee80a" class="outline-5">
<h5 id="packages"><a id="orgc6ee80a"></a>설치된 패키지</h5>
<div class="outline-text-5" id="text-packages">
<ul class="org-ul">
<li>node</li>
<li><a href="./npm.html">npm</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgad0b674" class="outline-5">
<h5 id="check"><a id="orgad0b674"></a>확인</h5>
<div class="outline-text-5" id="text-check">
<div class="org-src-container">
<pre class="src src-sh">$ node -v
v9.5.0
$ npm -v
5.6.0
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb162370" class="outline-4">
<h4 id="references"><a id="orgb162370"></a>참고자료</h4>
<div class="outline-text-4" id="text-references">
<ul class="org-ul">
<li><a href="https://kr.godaddy.com/help/install-nodejs-ubuntu-17395">https://kr.godaddy.com/help/install-nodejs-ubuntu-17395</a></li>
</ul>
</div>
</div>
</div>
