ko/index.html
<div id="outline-container-orgf6bc1dc" class="outline-3">
<h3 id="orgf6bc1dc">npm</h3>
<div class="outline-text-3" id="text-orgf6bc1dc">
</div>

<div id="outline-container-orga037c69" class="outline-4">
<h4 id="how-to-install"><a id="orga037c69"></a>설치 방법</h4>
<div class="outline-text-4" id="text-how-to-install">
</div>

<div id="outline-container-orgcc9a766" class="outline-5">
<h5 id="prerequisites"><a id="orgcc9a766"></a>필요 사항</h5>
<div class="outline-text-5" id="text-prerequisites">
</div>
</div>

<div id="outline-container-org4d8ac69" class="outline-5">
<h5 id="install"><a id="org4d8ac69"></a>설치</h5>
<div class="outline-text-5" id="text-install">
<p>
See <a href="./node.html">node</a>
</p>
</div>
</div>

<div id="outline-container-org8ec94a6" class="outline-5">
<h5 id="packages"><a id="org8ec94a6"></a>설치된 패키지</h5>
<div class="outline-text-5" id="text-packages">
</div>
</div>

<div id="outline-container-org95b4a5c" class="outline-5">
<h5 id="check"><a id="org95b4a5c"></a>확인</h5>
<div class="outline-text-5" id="text-check">
</div>
</div>
</div>
</div>
<div id="outline-container-org14bcc61" class="outline-3">
<h3 id="org14bcc61">passwd</h3>
<div class="outline-text-3" id="text-org14bcc61">
</div>
</div>
<div id="outline-container-org1ed2c9b" class="outline-3">
<h3 id="org1ed2c9b">pip</h3>
<div class="outline-text-3" id="text-org1ed2c9b">
</div>

<div id="outline-container-orgefb8c68" class="outline-4">
<h4 id="how-to-install"><a id="orgefb8c68"></a>설치 방법</h4>
<div class="outline-text-4" id="text-how-to-install">
</div>

<div id="outline-container-org3b7162e" class="outline-5">
<h5 id="prerequisites"><a id="org3b7162e"></a>필요 사항</h5>
<div class="outline-text-5" id="text-prerequisites">
<ul class="org-ul">
<li><a href="./upate.html">update</a></li>
</ul>
</div>
</div>

<div id="outline-container-org672ec27" class="outline-5">
<h5 id="install"><a id="org672ec27"></a>설치</h5>
<div class="outline-text-5" id="text-install">
</div>

<ul class="org-ul"><li><a id="orgda3e238"></a>Ubuntu<br /><div class="outline-text-6" id="text-orgda3e238">
<div class="org-src-container">
<pre class="src src-sh">sudo apt-get install python3-pip
</pre>
</div>
</div></li></ul>
</div>

<div id="outline-container-orgfe25bfa" class="outline-5">
<h5 id="packages"><a id="orgfe25bfa"></a>설치된 패키지</h5>
<div class="outline-text-5" id="text-packages">
<ul class="org-ul">
<li>libexpat1-dev</li>
<li>libpython3-dev</li>
<li>libpython3.5-dev</li>
<li>python-pip-whl</li>
<li>python3-dev</li>
<li>python3-setuptools</li>
<li>python3-wheel</li>
<li>python3.5-dev</li>
</ul>
</div>
</div>

<div id="outline-container-orgc4ae83c" class="outline-5">
<h5 id="check"><a id="orgc4ae83c"></a>확인</h5>
<div class="outline-text-5" id="text-check">
</div>
</div>
</div>
</div>
<div id="outline-container-org25fb024" class="outline-3">
<h3 id="org25fb024">postfix</h3>
<div class="outline-text-3" id="text-org25fb024">
</div>

<div id="outline-container-orgfbf39bd" class="outline-4">
<h4 id="how-to-install"><a id="orgfbf39bd"></a>설치 방법</h4>
<div class="outline-text-4" id="text-how-to-install">
</div>

<div id="outline-container-orgf945dbb" class="outline-5">
<h5 id="prerequisites"><a id="orgf945dbb"></a>필요 사항</h5>
<div class="outline-text-5" id="text-prerequisites">
<ul class="org-ul">
<li><a href="./update.html">update</a></li>
</ul>
</div>
</div>

<div id="outline-container-org75b4d08" class="outline-5">
<h5 id="install"><a id="org75b4d08"></a>설치</h5>
<div class="outline-text-5" id="text-install">
</div>

<ul class="org-ul"><li><a id="org9ccbbdf"></a>Ubuntu<br /><div class="outline-text-6" id="text-org9ccbbdf">
<div class="org-src-container">
<pre class="src src-sh">$ sudo apt-get install postfix
</pre>
</div>
</div></li></ul>
</div>

<div id="outline-container-orgac7d051" class="outline-5">
<h5 id="orgac7d051">Setup</h5>
<div class="outline-text-5" id="text-orgac7d051">
<ul class="org-ul">
<li>2. Internet Site</li>
<li>domain.example.com</li>
</ul>
</div>
</div>

<div id="outline-container-org71cc45d" class="outline-5">
<h5 id="packages"><a id="org71cc45d"></a>설치된 패키지</h5>
<div class="outline-text-5" id="text-packages">
</div>
</div>

<div id="outline-container-org448b4ed" class="outline-5">
<h5 id="check"><a id="org448b4ed"></a>확인</h5>
<div class="outline-text-5" id="text-check">
<div class="org-src-container">
<pre class="src src-sh">$ sudo postfix start
postfix: Postfix is running with backwards-compatible default settings
postfix: See http://www.postfix.org/COMPATIBILITY_README.html for details
postfix: To disable backwards compatibility use <span style="font-style: italic;">"postconf compatibility_level=2"</span> and <span style="font-style: italic;">"postfix reload"</span>
postfix/postfix-script: fatal: the Postfix mail system is already running

$ sudo postfix status
postfix: Postfix is running with backwards-compatible default settings
postfix: See http://www.postfix.org/COMPATIBILITY_README.html for details
postfix: To disable backwards compatibility use <span style="font-style: italic;">"postconf compatibility_level=2"</span> and <span style="font-style: italic;">"postfix reload"</span>
postfix/postfix-script: the Postfix mail system is running: PID: 10909

$ telnet localhost 25
Trying 127.0.0.1...
Connected to 127.0.0.1.
Escape character is <span style="font-style: italic;">'^]'</span>.
220 gitlab.me ESMTP Postfix (Ubuntu)

quit
</pre>
</div>
</div>
</div>
</div>
