ko/index.html

<div id="outline-container-org98f6415" class="outline-4">
<h4 id="seealso"><a id="org98f6415"></a>관련 항목</h4>
<div class="outline-text-4" id="text-seealso">
<ul class="org-ul">
<li><a href="./sendmail.html">sendmail</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orga84be33" class="outline-3">
<h3 id="orga84be33">rpm</h3>
<div class="outline-text-3" id="text-orga84be33">
</div>
</div>
<div id="outline-container-org2cad2da" class="outline-3">
<h3 id="org2cad2da">rsync</h3>
<div class="outline-text-3" id="text-org2cad2da">
</div>

<div id="outline-container-orga07f96c" class="outline-4">
<h4 id="how-to-install"><a id="orga07f96c"></a>설치 방법</h4>
<div class="outline-text-4" id="text-how-to-install">
</div>

<div id="outline-container-org4537982" class="outline-5">
<h5 id="prerequisites"><a id="org4537982"></a>필요 사항</h5>
<div class="outline-text-5" id="text-prerequisites">
</div>
</div>

<div id="outline-container-org6d31833" class="outline-5">
<h5 id="install"><a id="org6d31833"></a>설치</h5>
<div class="outline-text-5" id="text-install">
</div>

<ul class="org-ul"><li><a id="org2b222b6"></a>Ubuntu<br /><div class="outline-text-6" id="text-org2b222b6">
<div class="org-src-container">
<pre class="src src-sh" id="orgeb8a065">$ sudo apt-get install rsync
</pre>
</div>
</div></li>

<li><a id="org2edc18a"></a>CentOS<br /><div class="outline-text-6" id="text-org2edc18a">
<div class="org-src-container">
<pre class="src src-sh" id="org65ee601">$ sudo yum install rsync
</pre>
</div>
</div></li></ul>
</div>

<div id="outline-container-orgd350d8f" class="outline-5">
<h5 id="packages"><a id="orgd350d8f"></a>설치된 패키지</h5>
<div class="outline-text-5" id="text-packages">
</div>
</div>

<div id="outline-container-orgadeb681" class="outline-5">
<h5 id="check"><a id="orgadeb681"></a>확인</h5>
<div class="outline-text-5" id="text-check">
</div>
</div>
</div>

<div id="outline-container-org27e1f0b" class="outline-4">
<h4 id="references"><a id="org27e1f0b"></a>참고자료</h4>
<div class="outline-text-4" id="text-references">
<ul class="org-ul">
<li><a href="http://oral.o-r.kr/oral/index.php/pclinuxos/?pageid=1&amp;mod=document&amp;uid=272&amp;kboard_comments_sort=oldest">rsync로 백업하기</a></li>
<li><a href="http://kkamagistory.tistory.com/365">rsync 옵션 및 사용법</a></li>
<li><a href="https://askubuntu.com/questions/939659/ubuntu-16-04-how-to-install-rsync-server-for-other-systems-to-access-via-ssh-usi">https://askubuntu.com/questions/939659/ubuntu-16-04-how-to-install-rsync-server-for-other-systems-to-access-via-ssh-usi</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgc0ac8cd" class="outline-3">
<h3 id="orgc0ac8cd">ruby</h3>
<div class="outline-text-3" id="text-orgc0ac8cd">
</div>

<div id="outline-container-orgf086b7b" class="outline-4">
<h4 id="how-to-install"><a id="orgf086b7b"></a>설치 방법</h4>
<div class="outline-text-4" id="text-how-to-install">
</div>

<div id="outline-container-org209efe7" class="outline-5">
<h5 id="prerequisites"><a id="org209efe7"></a>필요 사항</h5>
<div class="outline-text-5" id="text-prerequisites">
<ul class="org-ul">
<li><a href="./apt-add-repository.html">apt-add-repository</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgce4f7a6" class="outline-5">
<h5 id="install"><a id="orgce4f7a6"></a>설치</h5>
<div class="outline-text-5" id="text-install">
</div>
</div>

<div id="outline-container-org70955a2" class="outline-5">
<h5 id="packages"><a id="org70955a2"></a>설치된 패키지</h5>
<div class="outline-text-5" id="text-packages">
<ul class="org-ul">
<li>ruby</li>
<li><a href="./gem.html">gem</a></li>
<li>rake</li>
</ul>
</div>
</div>

<div id="outline-container-org0d6d362" class="outline-5">
<h5 id="check"><a id="org0d6d362"></a>확인</h5>
<div class="outline-text-5" id="text-check">
<div class="org-src-container">
<pre class="src src-sh">$ ruby -v
ruby 2.5.0p0 (2017-12-25 revision 61468) [x86_64-linux-gnu]
$ gem -v
2.7.3
$ rake --version
rake, version 10.5.0
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org82ffce9" class="outline-4">
<h4 id="references"><a id="org82ffce9"></a>참고자료</h4>
<div class="outline-text-4" id="text-references">
<ul class="org-ul">
<li><a href="https://github.com/travis-ci/travis.rb/issues/391">https://github.com/travis-ci/travis.rb/issues/391</a></li>
<li><a href="https://www.ruby-lang.org/en/downloads/">https://www.ruby-lang.org/en/downloads/</a></li>
</ul>
</div>
</div>
</div>
