ko/index.html
<div id="outline-container-org3d22d6c" class="outline-3">
<h3 id="org3d22d6c">samba</h3>
<div class="outline-text-3" id="text-org3d22d6c">
</div>
</div>
<div id="outline-container-orga6117bb" class="outline-3">
<h3 id="orga6117bb">sendmail</h3>
<div class="outline-text-3" id="text-orga6117bb">
</div>

<div id="outline-container-org373c7de" class="outline-4">
<h4 id="how-to-install"><a id="org373c7de"></a>설치 방법</h4>
<div class="outline-text-4" id="text-how-to-install">
</div>

<div id="outline-container-orgeaf2b0e" class="outline-5">
<h5 id="prerequisites"><a id="orgeaf2b0e"></a>필요 사항</h5>
<div class="outline-text-5" id="text-prerequisites">
<ul class="org-ul">
<li><a href="./update.html">update</a></li>
</ul>
</div>
</div>

<div id="outline-container-org47b394f" class="outline-5">
<h5 id="install"><a id="org47b394f"></a>설치</h5>
<div class="outline-text-5" id="text-install">
<div class="org-src-container">
<pre class="src src-sh">$ sudo apt-get install sendmail
</pre>
</div>
</div>
</div>

<div id="outline-container-orgae5cac7" class="outline-5">
<h5 id="packages"><a id="orgae5cac7"></a>설치된 패키지</h5>
<div class="outline-text-5" id="text-packages">
</div>
</div>

<div id="outline-container-org2c84078" class="outline-5">
<h5 id="check"><a id="org2c84078"></a>확인</h5>
<div class="outline-text-5" id="text-check">
</div>
</div>
</div>
</div>
<div id="outline-container-orgf00adb3" class="outline-3">
<h3 id="orgf00adb3">shutdown</h3>
<div class="outline-text-3" id="text-orgf00adb3">
</div>
</div>
<div id="outline-container-orgbd0f5ca" class="outline-3">
<h3 id="orgbd0f5ca">squid</h3>
<div class="outline-text-3" id="text-orgbd0f5ca">
</div>
</div>
<div id="outline-container-org7924ee3" class="outline-3">
<h3 id="org7924ee3">ssh</h3>
<div class="outline-text-3" id="text-org7924ee3">
</div>

<div id="outline-container-org4e1e126" class="outline-4">
<h4 id="how-to-install"><a id="org4e1e126"></a>설치 방법</h4>
<div class="outline-text-4" id="text-how-to-install">
</div>

<div id="outline-container-org27f7da8" class="outline-5">
<h5 id="prerequisites"><a id="org27f7da8"></a>필요 사항</h5>
<div class="outline-text-5" id="text-prerequisites">
<ul class="org-ul">
<li><a href="./update.html">update</a></li>
</ul>
</div>
</div>

<div id="outline-container-org058bb2f" class="outline-5">
<h5 id="install"><a id="org058bb2f"></a>설치</h5>
<div class="outline-text-5" id="text-install">
<div class="org-src-container">
<pre class="src src-sh">$ sudo apt-get install openssh-server
$ sudo service ssh restart
</pre>
</div>
</div>
</div>

<div id="outline-container-org350df51" class="outline-5">
<h5 id="packages"><a id="org350df51"></a>설치된 패키지</h5>
<div class="outline-text-5" id="text-packages">
</div>
</div>

<div id="outline-container-orgea6f781" class="outline-5">
<h5 id="check"><a id="orgea6f781"></a>확인</h5>
<div class="outline-text-5" id="text-check">
<div class="org-src-container">
<pre class="src src-sh">$ sudo service ssh status
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org528ff29" class="outline-4">
<h4 id="references"><a id="org528ff29"></a>참고자료</h4>
<div class="outline-text-4" id="text-references">
<ul class="org-ul">
<li><a href="http://linux-sys-adm.com/how-to-install-and-configure-ssh-on-ubuntu-server-14.04-lts-step-by-step/">How to install and configure SSH on Ubuntu 14.04</a></li>
<li><a href="http://ubuntuhandbook.org/index.php/2016/04/enable-ssh-ubuntu-16-04-lts/">How to Enable SSH in Ubuntu 16.04 LTS</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgb1accfd" class="outline-3">
<h3 id="orgb1accfd">sudo</h3>
<div class="outline-text-3" id="text-orgb1accfd">
</div>

<div id="outline-container-orgc0ca28a" class="outline-4">
<h4 id="how-to-install"><a id="orgc0ca28a"></a>설치 방법</h4>
<div class="outline-text-4" id="text-how-to-install">
</div>

<div id="outline-container-org91ac39e" class="outline-5">
<h5 id="prerequisites"><a id="org91ac39e"></a>필요 사항</h5>
<div class="outline-text-5" id="text-prerequisites">
</div>
</div>

<div id="outline-container-orge874e84" class="outline-5">
<h5 id="install"><a id="orge874e84"></a>설치</h5>
<div class="outline-text-5" id="text-install">
<p>
루트 유저일 경우에만 설치 가능합니다.
</p>

<div class="org-src-container">
<pre class="src src-sh">$ apt-get install sudo -y
</pre>
</div>
</div>
</div>
