ko/index.html

<div id="outline-container-org0e9ab6d" class="outline-5">
<h5 id="packages"><a id="org0e9ab6d"></a>설치된 패키지</h5>
<div class="outline-text-5" id="text-packages">
</div>
</div>

<div id="outline-container-org4d67089" class="outline-5">
<h5 id="check"><a id="org4d67089"></a>확인</h5>
<div class="outline-text-5" id="text-check">
</div>
</div>
</div>
</div>
<div id="outline-container-org5fa870e" class="outline-3">
<h3 id="org5fa870e">tail</h3>
<div class="outline-text-3" id="text-org5fa870e">
</div>
</div>
<div id="outline-container-orgb893204" class="outline-3">
<h3 id="orgb893204">tar</h3>
<div class="outline-text-3" id="text-orgb893204">
</div>
</div>
<div id="outline-container-org2b69160" class="outline-3">
<h3 id="org2b69160">template</h3>
<div class="outline-text-3" id="text-org2b69160">
</div><div id="outline-container-org20af722" class="outline-4">
<h4 id="overview"><a id="org20af722"></a>개요</h4>
<div class="outline-text-4" id="text-overview">
</div>
</div>

<div id="outline-container-org260c8be" class="outline-4">
<h4 id="how-to-install"><a id="org260c8be"></a>설치 방법</h4>
<div class="outline-text-4" id="text-how-to-install">
</div>

<div id="outline-container-org336fadc" class="outline-5">
<h5 id="prerequisites"><a id="org336fadc"></a>필요 사항</h5>
<div class="outline-text-5" id="text-prerequisites">
</div>
</div>

<div id="outline-container-org918526a" class="outline-5">
<h5 id="install"><a id="org918526a"></a>설치</h5>
<div class="outline-text-5" id="text-install">
</div>
</div>

<div id="outline-container-org66899d1" class="outline-5">
<h5 id="packages"><a id="org66899d1"></a>설치된 패키지</h5>
<div class="outline-text-5" id="text-packages">
</div>
</div>

<div id="outline-container-org33c1d2f" class="outline-5">
<h5 id="check"><a id="org33c1d2f"></a>확인</h5>
<div class="outline-text-5" id="text-check">
</div>
</div>
</div>

<div id="outline-container-org7c9b49d" class="outline-4">
<h4 id="usage"><a id="org7c9b49d"></a>사용법</h4>
<div class="outline-text-4" id="text-usage">
</div>

<div id="outline-container-org951688a" class="outline-5">
<h5 id="syntax"><a id="org951688a"></a>구조</h5>
<div class="outline-text-5" id="text-syntax">
</div>
</div>

<div id="outline-container-orgdaf66e8" class="outline-5">
<h5 id="configuration"><a id="orgdaf66e8"></a>설정</h5>
<div class="outline-text-5" id="text-configuration">
</div>
</div>

<div id="outline-container-org3d5e407" class="outline-5">
<h5 id="options"><a id="org3d5e407"></a>옵션</h5>
<div class="outline-text-5" id="text-options">
</div>
</div>

<div id="outline-container-org4b5ba47" class="outline-5">
<h5 id="examples"><a id="org4b5ba47"></a>사용 예</h5>
<div class="outline-text-5" id="text-examples">
</div>
</div>
</div>

<div id="outline-container-org17eb148" class="outline-4">
<h4 id="seealso"><a id="org17eb148"></a>관련 항목</h4>
<div class="outline-text-4" id="text-seealso">
</div>
</div>

<div id="outline-container-orgdd68555" class="outline-4">
<h4 id="references"><a id="orgdd68555"></a>참고자료</h4>
<div class="outline-text-4" id="text-references">
</div>
</div>
</div>
<div id="outline-container-orgeab5246" class="outline-3">
<h3 id="orgeab5246">travis</h3>
<div class="outline-text-3" id="text-orgeab5246">
</div>

<div id="outline-container-orge1f28a5" class="outline-4">
<h4 id="how-to-install"><a id="orge1f28a5"></a>설치 방법</h4>
<div class="outline-text-4" id="text-how-to-install">
</div>

<div id="outline-container-org9f3d269" class="outline-5">
<h5 id="prerequisites"><a id="org9f3d269"></a>필요 사항</h5>
<div class="outline-text-5" id="text-prerequisites">
<ul class="org-ul">
<li><a href="./gem.html">gem</a></li>
<li><a href="./make.html">make</a></li>
<li><a href="./dh-autoreconf.html">dh-autoreconf</a></li>
</ul>
</div>
</div>

<div id="outline-container-org13f0eb8" class="outline-5">
<h5 id="install"><a id="org13f0eb8"></a>설치</h5>
<div class="outline-text-5" id="text-install">
<div class="org-src-container">
<pre class="src src-sh">$ sudo gem install travis
</pre>
</div>
</div>
</div>
