ko/index.html

<div id="outline-container-orgcc1b6f6" class="outline-5">
<h5 id="packages"><a id="orgcc1b6f6"></a>설치된 패키지</h5>
<div class="outline-text-5" id="text-packages">
</div>
</div>

<div id="outline-container-orgffa6644" class="outline-5">
<h5 id="check"><a id="orgffa6644"></a>확인</h5>
<div class="outline-text-5" id="text-check">
<div class="org-src-container">
<pre class="src src-sh">$ travis -v
1.8.8
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-orged00aba" class="outline-3">
<h3 id="orged00aba">tripwire</h3>
<div class="outline-text-3" id="text-orged00aba">
</div>
</div>
<div id="outline-container-org36346c9" class="outline-3">
<h3 id="org36346c9">update</h3>
<div class="outline-text-3" id="text-org36346c9">
</div>

<div id="outline-container-orgb456583" class="outline-4">
<h4 id="how-to-install"><a id="orgb456583"></a>설치 방법</h4>
<div class="outline-text-4" id="text-how-to-install">
</div>

<div id="outline-container-orgdcb1190" class="outline-5">
<h5 id="prerequisites"><a id="orgdcb1190"></a>필요 사항</h5>
<div class="outline-text-5" id="text-prerequisites">
</div>
</div>

<div id="outline-container-org7c7162c" class="outline-5">
<h5 id="install"><a id="org7c7162c"></a>설치</h5>
<div class="outline-text-5" id="text-install">
<div class="org-src-container">
<pre class="src src-sh">$ sudo apt update &amp;&amp; sudo apt upgrade
</pre>
</div>
</div>
</div>
