ko/index.html

<div id="outline-container-org5ad4967" class="outline-5">
<h5 id="packages"><a id="org5ad4967"></a>설치된 패키지</h5>
<div class="outline-text-5" id="text-packages">
</div>
</div>

<div id="outline-container-org337a936" class="outline-5">
<h5 id="check"><a id="org337a936"></a>확인</h5>
<div class="outline-text-5" id="text-check">
</div>
</div>
</div>

<div id="outline-container-orgd4460b5" class="outline-4">
<h4 id="seealso"><a id="orgd4460b5"></a>관련 항목</h4>
<div class="outline-text-4" id="text-seealso">
</div>
</div>

<div id="outline-container-org05e3f38" class="outline-4">
<h4 id="references"><a id="org05e3f38"></a>참고자료</h4>
<div class="outline-text-4" id="text-references">
</div>
</div>
</div>
<div id="outline-container-orge46666d" class="outline-3">
<h3 id="orge46666d">useradd</h3>
<div class="outline-text-3" id="text-orge46666d">
</div>
</div>
<div id="outline-container-org16071dd" class="outline-3">
<h3 id="org16071dd">userdel</h3>
<div class="outline-text-3" id="text-org16071dd">
</div>
</div>
<div id="outline-container-org5a5def5" class="outline-3">
<h3 id="org5a5def5">usermod</h3>
<div class="outline-text-3" id="text-org5a5def5">
</div>
</div>
<div id="outline-container-orge71bd52" class="outline-3">
<h3 id="orge71bd52">vim</h3>
<div class="outline-text-3" id="text-orge71bd52">
</div>

<div id="outline-container-orge85ac8d" class="outline-4">
<h4 id="how-to-install"><a id="orge85ac8d"></a>설치 방법</h4>
<div class="outline-text-4" id="text-how-to-install">
</div>

<div id="outline-container-orgab2c7ce" class="outline-5">
<h5 id="prerequisites"><a id="orgab2c7ce"></a>필요 사항</h5>
<div class="outline-text-5" id="text-prerequisites">
<ul class="org-ul">
<li><a href="./update.html">update</a></li>
<li><a href="./git.html">git</a></li>
</ul>
</div>

<ul class="org-ul"><li><a id="orge42653d"></a>from Source Code<br /><div class="outline-text-6" id="text-orge42653d">
<div class="org-src-container">
<pre class="src src-sh">$ git clone https://github.com/vim/vim.git
$ cd vim/src
$ make
</pre>
</div>
</div></li>

<li><a id="org259ea39"></a>Ubuntu<br /><div class="outline-text-6" id="text-org259ea39">
<div class="org-src-container">
<pre class="src src-sh">$ apt-get install vim
</pre>
</div>
</div></li></ul>
</div>

<div id="outline-container-org944ed6d" class="outline-5">
<h5 id="install"><a id="org944ed6d"></a>설치</h5>
<div class="outline-text-5" id="text-install">
</div>
</div>

<div id="outline-container-org60f3e87" class="outline-5">
<h5 id="packages"><a id="org60f3e87"></a>설치된 패키지</h5>
<div class="outline-text-5" id="text-packages">
</div>
</div>

<div id="outline-container-orgff2d184" class="outline-5">
<h5 id="check"><a id="orgff2d184"></a>확인</h5>
<div class="outline-text-5" id="text-check">
<div class="org-src-container">
<pre class="src src-sh">$ vim --version
</pre>
</div>

<pre class="example">
Huge version without GUI.  Features included (+) or not (-):
+acl             +farsi           +mouse_netterm   +tag_binary
+arabic          +file_in_path    +mouse_sgr       +tag_old_static
+autocmd         +find_in_path    -mouse_sysmouse  -tag_any_white
-balloon_eval    +float           +mouse_urxvt     -tcl
-browse          +folding         +mouse_xterm     +terminfo
++builtin_terms  -footer          +multi_byte      +termresponse
+byte_offset     +fork()          +multi_lang      +textobjects
+channel         +gettext         -mzscheme        +timers
+cindent         -hangul_input    +netbeans_intg   +title
-clientserver    +iconv           +packages        -toolbar
-clipboard       +insert_expand   +path_extra      +user_commands
+cmdline_compl   +job             -perl            +vertsplit
+cmdline_hist    +jumplist        +persistent_undo +virtualedit
+cmdline_info    +keymap          +postscript      +visual
+comments        +langmap         +printer         +visualextra
+conceal         +libcall         +profile         +viminfo
+cryptv          +linebreak       -python          +vreplace
+cscope          +lispindent      +python3         +wildignore
+cursorbind      +listcmds        +quickfix        +wildmenu
+cursorshape     +localmap        +reltime         +windows
+dialog_con      -lua             +rightleft       +writebackup
+diff            +menu            -ruby            -X11
+digraphs        +mksession       +scrollbind      -xfontset
-dnd             +modify_fname    +signs           -xim
-ebcdic          +mouse           +smartindent     -xsmp
+emacs_tags      -mouseshape      +startuptime     -xterm_clipboard
+eval            +mouse_dec       +statusline      -xterm_save
+ex_extra        +mouse_gpm       -sun_workshop    -xpm
+extra_search    -mouse_jsbterm   +syntax
   system vimrc file: "$VIM/vimrc"
     user vimrc file: "$HOME/.vimrc"
 2nd user vimrc file: "~/.vim/vimrc"
      user exrc file: "$HOME/.exrc"
  fall-back for $VIM: "/usr/share/vim"
Compilation: gcc -c -I. -Iproto -DHAVE_CONFIG_H   -Wdate-time  -g -O2 -fPIE -fstack-protector-strong -Wformat -Werror=format-security -U_FORTIFY_SOURCE -D_FORTIFY_SOURCE=1
Linking: gcc   -Wl,-Bsymbolic-functions -fPIE -pie -Wl,-z,relro -Wl,-z,now -Wl,--as-needed -o vim        -lm -ltinfo -lnsl  -lselinux  -lacl -lattr -lgpm -ldl     -L/usr/lib/python3.5/config-3.5m-x86_64-linux-gnu -lpython3.5m -lpthread -ldl -lutil -lm
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf34ad98" class="outline-4">
<h4 id="references"><a id="orgf34ad98"></a>참고자료</h4>
<div class="outline-text-4" id="text-references">
<ul class="org-ul">
<li><a href="http://www.vim.org/download.php">http://www.vim.org/download.php</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orga07f4e6" class="outline-3">
<h3 id="orga07f4e6">wget</h3>
<div class="outline-text-3" id="text-orga07f4e6">
</div>

<div id="outline-container-org6997349" class="outline-4">
<h4 id="how-to-install"><a id="org6997349"></a>설치 방법</h4>
<div class="outline-text-4" id="text-how-to-install">
</div>

<div id="outline-container-org9264267" class="outline-5">
<h5 id="prerequisites"><a id="org9264267"></a>필요 사항</h5>
<div class="outline-text-5" id="text-prerequisites">
</div>
</div>

<div id="outline-container-orga6660dd" class="outline-5">
<h5 id="install"><a id="orga6660dd"></a>설치</h5>
<div class="outline-text-5" id="text-install">
<div class="org-src-container">
<pre class="src src-sh">$ sudo apt-get install wget
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd27dea7" class="outline-5">
<h5 id="packages"><a id="orgd27dea7"></a>설치된 패키지</h5>
<div class="outline-text-5" id="text-packages">
</div>
</div>

<div id="outline-container-org737c608" class="outline-5">
<h5 id="check"><a id="org737c608"></a>확인</h5>
<div class="outline-text-5" id="text-check">
</div>
</div>
</div>
</div>
<div id="outline-container-orgf56b9b0" class="outline-3">
<h3 id="orgf56b9b0">xinetd</h3>
<div class="outline-text-3" id="text-orgf56b9b0">
</div>
</div>
<div id="outline-container-org7f1a11b" class="outline-3">
<h3 id="org7f1a11b">xmodmap</h3>
<div class="outline-text-3" id="text-org7f1a11b">
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2018-02-11</p>
<p class="author">Author: Dongsoo Lee</p>
<p class="date">Created: 2018-02-20 Tue 13:23</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
